<!DOCTYPE HTML PUBLIC "-//SoftQuad Software//DTD HoTMetaL PRO 6.0::19990601::extensions to HTML 4.0//EN" "hmpro6.dtd">
<HTML> 
  <HEAD>
	 <META NAME="KeyWords"
	  CONTENT="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">
	 
	 <TITLE> Approches &eacute;cologiques de la gestion des ressources</TITLE>
	 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">

<!--#include virtual="/include/script.inc" -->
	 <LINK REL="stylesheet" HREF="/css/cormas.css"> 
  </HEAD> 
  <BODY MARGINWIDTH="0" MARGINHEIGHT="0" TOPMARGIN="0" LEFTMARGIN="0"
	ONLOAD="MM_preloadImages('/images/fr/accueil_r.gif','/images/fr/demarche_r.gif','/images/fr/logiciel_r.gif','/images/fr/applications_r.gif','/images/fr/biblio_r.gif','/images/fr/formation_r.gif','/images/fr/reseaux_r.gif')"
	BGCOLOR="#FFFFFF">
<!--#include virtual="haut.inc" -->
	 <TABLE CELLSPACING="0" CELLPADDING="0" BORDER="0" WIDTH="100%"> 
		<TR>
    <!--#include virtual="sommair.inc" -->
		  <TD WIDTH="*" VALIGN="top" BGCOLOR="#FFFFFF"> 
			 <P>&nbsp;</P> 
			 <P> </P> 
			 <H1> Approches &eacute;cologiques</H1> 
			 <H2>Ecologie et dynamique des ressources naturelles</H2> 
			 <P ALIGN="left">L'approche scientifique de la dynamique des
				ressources naturelles revient &agrave; caract&eacute;riser l'influence de
				l'environnement sur l'abondance et la disponibilit&eacute; d'une ressource.
				D'un point de vue &eacute;cologique, l'environnement est l'ensemble des
				facteurs naturels (physiques, chimiques et biologiques) susceptibles d'agir sur
				les organismes vivants. Dans ce cadre, tout facteur qui peut &ecirc;tre
				consomm&eacute; ou utilis&eacute; par un organisme est d&eacute;fini comme
				ressource naturelle (Begon et al, 1990).</P> 
			 <P ALIGN="left">Le syst&egrave;me "individu - environnement -
				population" (Barbault, 1992), au c&#156;ur de la discipline &eacute;cologique,
				pr&eacute;sente une multitude d'interactions enchev&ecirc;tr&eacute;es qui
				peuvent &ecirc;tre regroup&eacute;es en deux cat&eacute;gories : les
				<B>interactions entre organismes</B> (comp&eacute;tition, pr&eacute;dation,
				mutualisme, etc.), et les interactions <B>entre les organismes et leur
				environnement physique</B> (les " conditions " environnementales).</P> 
			 <P ALIGN="left">Par essence, l'&eacute;cologie s'interroge sur la
				fa&ccedil;on d'aborder l'&eacute;tude des <B>syst&egrave;mes complexes</B>. Une
				entit&eacute; complexe (Fogelman Souli&eacute;, 1991; Gell-Mann, 1994) est
				compos&eacute;e d'&eacute;l&eacute;ments diff&eacute;rents, qui sont en
				interaction, et qui se combinent d'une mani&egrave;re qui n'est pas
				imm&eacute;diatement saisissable : la complexit&eacute; d'un syst&egrave;me est
				dans l'&#156;il de l'observateur.</P> 
			 <P ALIGN="left">Cette id&eacute;e que la notion de complexit&eacute;
				est indissociable de la perception n'est pas neutre : elle renvoie &agrave;
				l'importance du choix des <B>niveaux d'observation</B> du syst&egrave;me
				&eacute;tudi&eacute;. En &eacute;cologie, il n'existe pas d'&eacute;chelle pour
				observer tous les ph&eacute;nom&egrave;nes. Conventionnellement, la
				hi&eacute;rarchie des &eacute;chelles (Allen et Starr, 1982) fait
				r&eacute;f&eacute;rence aux niveaux d'organisation : cellule, organisme,
				population, communaut&eacute;, &eacute;cosyst&egrave;me, paysage, biome,
				biosph&egrave;re. Un des enjeux majeurs de l'&eacute;cologie est de pouvoir
				prendre en compte la multiplicit&eacute; des &eacute;chelles d'&eacute;tude
				afin d'int&eacute;grer, lors d'une phase appel&eacute;e "transfert
				d'&eacute;chelle", chacun des ph&eacute;nom&egrave;nes &eacute;tudi&eacute;s
				&agrave; leurs niveaux sp&eacute;cifiques. </P> 
			 <H2>Interactions entre &eacute;chelles et entre disciplines</H2> 
			 <P><B>Un cloisonnement de la communaut&eacute; existe</B>, de fait,
				entre les chercheurs qui travaillent en <B>&eacute;thologie </B>sur le
				comportement des individus et ceux qui travaillent en <B>&eacute;cologie du
				paysage</B> sur la structuration ou l'organisation de l'espace. Ce
				cloisonnement est un frein au d&eacute;veloppement d'avanc&eacute;es
				significatives dans le domaine de l'&eacute;cologie.</P> 
			 <P>Consid&eacute;rons par exemple un probl&egrave;me de gestion des
				ressources naturelles renouvelables qui se pose actuellement avec une
				acuit&eacute; particuli&egrave;re : l'estimation du risque d'extinction d'une
				esp&egrave;ce en fonction de la fragmentation de l'espace. Pour travailler sur
				cette estimation, la connaissance d'indicateurs globaux de la structuration
				spatiale du paysage est n&eacute;cessaire. Mais la connaissance de processus
				tels que le d&eacute;placement des animaux, la s&eacute;lection des habitats,
				v&eacute;ritables m&eacute;canismes explicatifs du fonctionnement du
				syst&egrave;me est &eacute;galement indispensable. </P> 
			 <P>Leur prise en compte dans un mod&egrave;le permet de proposer des
				sch&eacute;mas explicatifs qui donnent du sens aux indicateurs d&eacute;finis
				au niveau sup&eacute;rieur.</P> 
			 <P>C'est, en l'occurrence, essentiellement &agrave; ce niveau plus
				global que le <B>rapprochement interdisciplinaire</B>, vital pour les sciences
				de l'environnement, s'exprime. La discipline de l'&eacute;cologie du paysage
				(Forman et Gordon, 1986 ; Kareiva et Wennergren, 1995), d&eacute;finie comme la
				r&eacute;union de la g&eacute;ographie et de l'&eacute;cologie, repose sur le
				principe que les probl&egrave;mes environnementaux respectent rarement les
				limites conventionnellement attribu&eacute;es &agrave; tel ou tel sujet, et que
				leurs solutions n&eacute;cessitent &agrave; la fois une compr&eacute;hension
				des aspects physiques et &eacute;cologiques des &eacute;cosyst&egrave;mes, mais
				aussi de la fa&ccedil;on dont ils interagissent avec les facteurs politiques,
				&eacute;conomiques et sociaux. </P> 
			 <H2>R&eacute;f&eacute;rences</H2> 
			 <P>Allen T.F.H. et Starr T.B. 1982. Hierarchy : Perspectives for
				Ecological Complexity. University of Chicago Press, Chicago.</P> 
			 <P>Barbault R. 1992. Ecologie des peuplements. Structure, dynamique
				et &eacute;volution. Masson, Paris.</P> 
			 <P>Begon M., Harper J.L. et Townsend C.R. 1990. Ecology. Individuals,
				Populations and Communities. Blackwell, Cambridge.</P> 
			 <P>Fogelman Souli&eacute; F. 1991. Les th&eacute;ories de la
				complexit&eacute; autour de l'&#156;uvre d'Henri Atlan. Seuil, Paris.</P> 
			 <P>Forman R.T.T. et Gordon M. 1986. Landscape Ecology. John Wiley
				&amp; Sons, New York.</P> 
			 <P>Gell-Mann M. 1994. Le quark et le jaguar. Voyage au c&#156;ur du
				simple et du complexe. Albin Michel Sciences, Paris.</P> 
			 <P>Kareiva P. et Wennergren U. 1995. Connecting landscape patterns to
				ecosystem and population processes. Nature, 373: 299-302. </P>
    
    <!--#include virtual="/include/copyright_fr.inc" -->
		  </TD> 
		  <TD WIDTH="15" VALIGN="top" BGCOLOR="#FFFFFF"> 
			 <DIV ALIGN="right"></DIV> </TD> 
		</TR> 
	 </TABLE> </BODY>
</HTML>
