<!DOCTYPE HTML PUBLIC "-//SoftQuad Software//DTD HoTMetaL PRO 6.0::19990601::extensions to HTML 4.0//EN" "hmpro6.dtd">
<HTML> 
  <HEAD>
	 <META NAME="KeyWords"
	  CONTENT="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">
	 
	 <TITLE> Deux approches de la gestion des ressources</TITLE>
	 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">

<!--#include virtual="/include/script.inc" -->
	 <LINK REL="stylesheet" HREF="/css/cormas.css"> 
  </HEAD> 
  <BODY MARGINWIDTH="0" MARGINHEIGHT="0" TOPMARGIN="0" LEFTMARGIN="0"
	ONLOAD="MM_preloadImages('/images/fr/accueil_r.gif','/images/fr/demarche_r.gif','/images/fr/logiciel_r.gif','/images/fr/applications_r.gif','/images/fr/biblio_r.gif','/images/fr/formation_r.gif','/images/fr/reseaux_r.gif')"
	BGCOLOR="#FFFFFF">
<!--#include virtual="haut.inc" -->
	 <TABLE CELLSPACING="0" CELLPADDING="0" BORDER="0" WIDTH="100%"> 
		<TR>
    <!--#include virtual="sommair.inc" -->
		  <TD WIDTH="*" VALIGN="top" BGCOLOR="#FFFFFF"> 
			 <P>&nbsp;</P>
			 <P> </P>
			 <H1>Deux approches de la gestion<BR> des ressources</H1> 
			 <P>De nombreux chercheurs s'int&eacute;ressent &agrave; la gestion
				des ressources naturelles. Nous citons ici deux groupes qui se sont
				structur&eacute;s autour de deux associations de recherches, l'International
				Society of Ecological Economics (Isee) et l'International Association for the
				Study of Common Property (Iascp). La premi&egrave;re s'est orient&eacute;e vers
				la recherche d'une formalisation int&eacute;gratrice du syst&egrave;me
				&eacute;cologique dans la pens&eacute;e &eacute;conomique. Quant &agrave; la
				seconde, elle s'int&eacute;resse &agrave; la gestion des biens communs, et plus
				particuli&egrave;rement des ressources naturelles renouvelables.</P> 
			 <H2>Les approches &eacute;conomiques</H2> 
			 
      <P ALIGN="left"><B>L'&eacute;conomie des ressources naturelles et de l'environnement</B> 
        propose un ensemble de th&eacute;ories et de concepts producteurs d'outils 
        de suivi, d'analyse, d'&eacute;valuation et de r&eacute;gulation (Dales, 
        1968 ; Arrow et Fisher, 1974 ; Bromley, 1991). En particulier, l'&eacute;conomie 
        va fournir une mod&eacute;lisation de l'exploitation des ressources renouvelables 
        destin&eacute;e &agrave; en contr&ocirc;ler la soutenabilit&eacute; gr&acirc;ce 
        &agrave; l'emploi d'instruments de gestion comme les taxes, les quotas, 
        les licences et permis, les subventions, les normes, les droits de propri&eacute;t&eacute;, 
        les march&eacute;s de droits.</P> 
			 <P ALIGN="left">Par ailleurs,<B> l'&eacute;conomie de
				l'environnement</B> s'appuie sur une repr&eacute;sentation circulaire de
				l'interaction homme-nature. L'environnement offre des services
				&eacute;valuables &agrave; la soci&eacute;t&eacute;, en retour les hommes
				transforment l'environnement, ce qui, en contraignant les d&eacute;cisions
				d'autres agents, constitue une externalit&eacute;. Des politiques et outils de
				gestion appropri&eacute;s permettent d'inciter &agrave; un usage efficient des
				services naturels et &agrave; la compensation des externalit&eacute;s.</P> 
			 <P ALIGN="left">Tant pour les services que pour les
				externalit&eacute;s, l'&eacute;conomie propose des m&eacute;thodes pour une
				&eacute;valuation mon&eacute;taire et donne ainsi des &eacute;l&eacute;ments
				pour un arbitrage entre diff&eacute;rents usages possibles d'un
				&eacute;cosyst&egrave;me, voire d'un paysage. De nombreuses critiques ayant
				&eacute;t&eacute; formul&eacute;es dans l'emploi normatif de ces
				m&eacute;thodes, celles-ci sont aujourd'hui pr&eacute;sent&eacute;es dans une
				logique de n&eacute;gociation entre les acteurs, faisant appel &agrave; leur
				pouvoir d'explicitation des repr&eacute;sentations.</P> 
			 <P ALIGN="left">Une des critiques de l'approche &eacute;conomique
				concerne la dimension temporelle, peu prise en compte dans une pens&eacute;e
				qui se donne pour objectif la d&eacute;finition d'un &eacute;quilibre entre
				ressources et soci&eacute;t&eacute;.</P> 
			 <P>L'approche <B>" ecological economics "</B> a ajout&eacute;
				&agrave; ce cadre d'analyse le concept de co-adaptation entre la sph&egrave;re
				naturelle et la sph&egrave;re sociale. De plus, les dynamiques sont
				diff&eacute;rentes d'un encha&icirc;nement de situations d'&eacute;quilibre.
				Les mod&eacute;lisations syst&eacute;miques qui repr&eacute;sentent la
				dynamique &agrave; travers des relations stocks-flux ont &eacute;t&eacute;
				tr&egrave;s utilis&eacute;es (Clark, 1990). </P> 
			 <H2>Les ressources en propri&eacute;t&eacute; commune</H2> 
			 <P>La cr&eacute;ation d'une association internationale pour
				l'&eacute;tude de la propri&eacute;t&eacute; commune (Iascp) a eu lieu dans la
				deuxi&egrave;me moiti&eacute; des ann&eacute;es 80. Il faut cependant en
				trouver les origines bien avant. Sans mobiliser l'histoire de la pens&eacute;e
				&eacute;conomique qui est pourtant sous-jacente au d&eacute;bat, la publication
				en 1968 de <B>la th&eacute;orie de la trag&eacute;die des communs</B>, par G.
				Hardin, est consid&eacute;r&eacute;e comme un acte fondateur. En effet,
				l'auteur exprime une pens&eacute;e selon laquelle une ressource commune soumise
				&agrave; des agents &eacute;conomiques rationnels est condamn&eacute;e &agrave;
				la disparition par sur-exploitation. Le probl&egrave;me &eacute;tant ainsi
				pos&eacute;, les solutions qui en r&eacute;sultent sont la privatisation ou la
				mise en place d'une autorit&eacute; centrale charg&eacute;e de g&eacute;rer
				l'acc&egrave;s aux ressources, c'est &agrave; dire de le contr&ocirc;ler en
				utilisant &agrave; cet effet des outils de gestion &eacute;conomique ou
				administrative.</P> 
			 <P>Les critiques les plus importantes de l'article de Hardin ont mis
				en &eacute;vidence que la trag&eacute;die n'est pas due au caract&egrave;re
				commun des ressources mais plut&ocirc;t &agrave; leur acc&egrave;s libre.
				<B>Les exemples sont nombreux pour illustrer qu'une ressource commune peut
				&ecirc;tre l'objet d'une gestion durable par la communaut&eacute;.</B></P> 
			 
      <P>S'opposant au courant de pens&eacute;e de Hardin sur l'impossibilit&eacute; 
        d'une action collective, de nombreux auteurs tels Ostrom (1990; 1999), 
        Berkes et al (1989), Stevenson (1991) ont pr&eacute;sent&eacute; les fondements 
        d'une approche institutionnaliste qui met l'accent sur les m&eacute;canismes 
        de r&eacute;gulation, formels ou informels, qui gouvernent la viabilit&eacute; 
        des &eacute;cosyst&egrave;mes. Gouverner fait r&eacute;f&eacute;rence 
        aux repr&eacute;sentations des acteurs et se fonde sur un principe de 
        n&eacute;gociation.</P> 
			 <P>Constatant le manque d'op&eacute;rationnalit&eacute; d'une
				approche locale en raison de l'interf&eacute;rence avec des acteurs
				ext&eacute;rieurs ou de contraintes provenant d'&eacute;chelles
				diff&eacute;rentes, l'&eacute;volution actuelle de la recherche tend vers le
				concept de<B> co-management </B>(McCay et Jones, 1997). Mais si le
				co-management a pu &ecirc;tre abord&eacute; dans le cas d'usagers utilisant la
				m&ecirc;me ressource pour le m&ecirc;me but (par exemple p&ecirc;cheurs,
				membres d'une association de bassins versants), l'enjeu en est maintenant
				l'extension &agrave; des ressources &agrave; usages multiples, qui impliquent
				d'autres formes d'arbitrage et de d&eacute;cision collective. </P> 
			 <H2>R&eacute;f&eacute;rences</H2> 
			 <P>Arrow K.J. et Fisher A. 1974. Environmental Preservation,
				Uncertainty, and Irresversibility. Quaterly Journal of Economics, 88:
				312-319.</P> 
			 <P>Berkes F., Feeny D., McCay B.J. et Acheson J.M. 1989. The benefits
				of the commons. Nature, 340: 91-93</P> 
			 <P>Bromley D.W. 1991. Environment and Economy, Property Rights and
				Public Policy. Blackwell, Cambridge.</P> 
			 <P>Clark C.W. 1990. Mathematical Bioeconomics; The Optimal Management
				of Renewable Resources. John Wiley &amp; Sons Inc., New York.</P> 
			 <P>Dales J.H. 1968. Pollution, Property and Prices, An Essay in
				Policy Making and Economics. University of Toronto Press, Toronto.</P> 
			 <P>Hardin G. 1968. The tragedy of the commons. Science 162 :
				1243-1248</P> 
			 <P>McCay B.J. et Jones B. 1997. Proceedings of the Workshop on Future
				Directions for Common Property Theory and Research. Ecopolicy Center for
				Agricultural, Environmental and Resource Issues, New Jersey.</P> 
			 
      <P>Ostrom E. 1990. Governing the Commons. Cambridge University Press, Cambridge.</P>
      <P>Ostrom, E. 1999. Coping with tragedies of the commons. American Review 
        of Political Science, 2: 493-535. </P> 
			 <P>Stevenson G.G. 1991. Common Property Economics. A General Theory
				and Land Use Applications. Cambridge University Press, Cambridge </P>
    
    <!--#include virtual="/include/copyright_fr.inc" -->
		  </TD> 
		  <TD WIDTH="15" VALIGN="top" BGCOLOR="#FFFFFF"> 
			 <DIV ALIGN="right"></DIV> </TD> 
		</TR> 
	 </TABLE> </BODY>
</HTML>
