<!DOCTYPE HTML PUBLIC "-//SoftQuad Software//DTD HoTMetaL PRO 6.0::19990601::extensions to HTML 4.0//EN" "hmpro6.dtd">
<HTML> 
  <HEAD>
	 <META NAME="KeyWords"
	  CONTENT="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">
	 
	 <TITLE> Etat de l'art au Cirad</TITLE>
	 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">

<!--#include virtual="/include/script.inc" -->
	 <LINK REL="stylesheet" HREF="/css/cormas.css"> 
  </HEAD> 
  <BODY MARGINWIDTH="0" MARGINHEIGHT="0" TOPMARGIN="0" LEFTMARGIN="0"
  ONLOAD="MM_preloadImages('/images/fr/accueil_r.gif','/images/fr/demarche_r.gif','/images/fr/logiciel_r.gif','/images/fr/applications_r.gif','/images/fr/biblio_r.gif','/images/fr/formation_r.gif','/images/fr/reseaux_r.gif')"
  BGCOLOR="#FFFFFF">
<!--#include virtual="haut.inc" -->
	 <TABLE CELLSPACING="0" CELLPADDING="0" BORDER="0" WIDTH="100%"> 
		<TR>
    <!--#include virtual="sommair.inc" --> 
    <TD WIDTH="*" VALIGN="top" BGCOLOR="#FFFFFF"> 
      <P>&nbsp; </P>
      <H1>Nos recherches au Cirad</H1>
      <H1>&nbsp; </H1>
      <P>&nbsp;</P>
      <P>Les recherches sur l'environnement abordent la problématique des ressources 
        et des externalités. Il s'agit par exemple de la gestion des ressources 
        naturelles renouvelables, des externalités de la production (d&eacute;chets, 
        pollution) et des espaces &agrave; usages multiples. Dans tous les cas, 
        l'enjeu est de mettre en place une régulation des usages collectifs. Qu'il 
        s'agisse de gestion de ressources, d'espaces ou d'externalités, les analyses 
        doivent tenir compte à la fois des dynamiques de la nature et de celles 
        de la société. Les <b>dynamiques naturelles</b> se caractérisent par l'imbrication 
        de processus multiples impliquant des espèces et des ressources variées, 
        à des échelles spatiales et temporelles différentes. Les <b>processus 
        sociaux</b> intéressent différents acteurs et plusieurs niveaux d'organisation, 
        depuis les individus ou les communautés d'usagers jusqu'aux grandes institutions 
        chargées du développement. </P>
      <P>Au sein du Cirad, le<B> projet Green </B>(gestion des ressources renouvelables, 
        environnement), cr&eacute;&eacute; en 1993 par Jacques Weber, s'int&eacute;resse 
        &agrave; l'articulation des processus locaux et globaux de<B> gestion 
        des ressources &agrave; usages multiples</B>. Les recherches s'orientent 
        autour de deux th&egrave;mes : les modes d'appropriation et les processus 
        de d&eacute;cision (Weber, 1993).</P>
      <ol>
        <li>Les <B>modes d'appropriation</B> regroupent les questions de repr&eacute;sentation, 
          d'acc&egrave;s, d'usage, de transfert et de r&eacute;partition des ressources. 
          L'analyse des modes d'appropriation d&eacute;bouche sur la question 
          des institutions et des modes de gestion.</li>
        <li>L'&eacute;tude des <B>processus de d&eacute;cision</B> s'int&eacute;resse 
          aux interactions entre des acteurs ayant diff&eacute;rents poids et 
          diff&eacute;rentes repr&eacute;sentations. Il s'agit de les analyser, 
          d'en comprendre la dynamique pour d&eacute;boucher sur une aide &agrave; 
          la n&eacute;gociation.</li>
      </ol>
      <P>Pour aller plus loin dans l'analyse des interactions, un domaine de recherche 
        est privil&eacute;gi&eacute; : celui de la relation entre l'&eacute;chelle 
        et la viabilit&eacute; des interactions. Les crit&egrave;res et contraintes 
        de viabilit&eacute; ne sont pas les m&ecirc;mes au niveau du village, 
        de la r&eacute;gion, ou de la plan&egrave;te. Il s'agit de comprendre 
        les liens entre les outils de gestion employ&eacute;s et la viabilit&eacute; 
        des interactions &agrave; ces diff&eacute;rentes &eacute;chelles.</P>
      <H2>L'int&eacute;gration entre niveaux</H2>
      <P>Le projet Green ne cherche pas &agrave; r&eacute;pondre &agrave; toutes 
        les questions pos&eacute;es ci-dessus. Une probl&eacute;matique nous para&icirc;t 
        cependant transversale : celle de l'int&eacute;gration de dynamiques sur 
        plusieurs &eacute;chelles spatiales et niveaux d'organisation. <B>Deux 
        approches</B> s'opposent pour la repr&eacute;sentation d'un syst&egrave;me 
        : l'une s'int&eacute;resse aux <B>interactions locales</B> pour remonter 
        aux organisations, l'autre aux <B>dynamiques globales</B> des organisations 
        en agr&eacute;geant les dynamiques locales. On retrouve cette dualit&eacute;, 
        dans les recherches, entre une &eacute;cologie centr&eacute;e sur l'individu 
        et une &eacute;cologie du paysage, entre une gestion locale et une gestion 
        r&eacute;gionale des ressources naturelles, entre une gestion locale des 
        biens communs et des outils &eacute;conomiques ou juridiques de gestion.</P>
      <P>Pour la gestion des ressources, il semble n&eacute;cessaire de <B>d&eacute;passer 
        cette bipolarit&eacute;</B> en cherchant &agrave; int&eacute;grer ces 
        diff&eacute;rents niveaux.</P>
      <H2>Simuler des interactions pour aider la gestion collective</H2>
      <P>Cette probl&eacute;matique a conduit le Cirad, d'une part, au <B>d&eacute;veloppement 
        d'outils </B>de mod&eacute;lisation qui permettent de simuler des interactions 
        sur plusieurs &eacute;chelles et, d'autre part, &agrave; une <B>r&eacute;flexion 
        m&eacute;thodologique</B> sur l'usage de ces outils.</P>
      <P>En appui &agrave; la gestion collective, les outils d'aide &agrave; la 
        d&eacute;cision et &agrave; la n&eacute;gociation repr&eacute;sentent 
        l'interd&eacute;pendance des acteurs dans les probl&egrave;mes de gestion 
        et leur r&eacute;solution, et confrontent les diff&eacute;rentes repr&eacute;sentations 
        des acteurs, du producteur au gestionnaire.</P>
      <P>Ces outils s'appuient sur la <B>mod&eacute;lisation des syst&egrave;mes 
        complexes</B> pour comprendre les dynamiques spatiales et sociales. Se 
        pose la question de l'int&eacute;gration des approches &eacute;conomiques 
        et g&eacute;ographiques dans une mod&eacute;lisation pens&eacute;e en 
        termes de comportements et d'interactions. Les outils de<B> caract&eacute;risation 
        des structures spatiales</B>, tels les Sig ou les logiciels d'analyse 
        spatiale sont ainsi coupl&eacute;s &agrave; des outils de simulation des 
        interactions, tels les automates cellulaires ou les syst&egrave;mes multi-agents.</P>
      <P>La d&eacute;marche se positionne en accompagnement des processus de prise 
        de d&eacute;cision. Montrer sur un monde artificiel la diversit&eacute; 
        des dynamiques locales et l'existence &eacute;ventuelle de processus de 
        r&eacute;gulation. Pr&eacute;senter sur un monde artificiel les effets 
        des outils de gestion pens&eacute;s &agrave; un niveau plus englobant 
        (r&eacute;gion, nation). </P>
      <P><B>Accompagner un processus de d&eacute;cision</B>, c'est aussi pouvoir 
        comparer les r&eacute;sultats des diff&eacute;rents sc&eacute;narios. 
        La r&eacute;flexion sur les indicateurs d'interaction, sur les m&eacute;thodes 
        pour donner une valeur aux diff&eacute;rents sc&eacute;narios constitue 
        un point essentiel du processus d'accompagnement.</P>
      <H2>R&eacute;f&eacute;rence</H2>
      <P>Weber J., 1995. Gestion des ressources renouvelables : fondements th&eacute;oriques 
        d'un programme de recherche. Paris, Cirad Green, 21 p. <A HREF="/pdf/green.pdf">Document 
        &agrave; t&eacute;l&eacute;charger</A>. (format pdf, 92 ko). </P>
      <P>Weber J. 1996. Gest&atilde;o de recursos renovaveis: fundamentos teoricos 
        de um programa de pesquisas, in Gest&atilde;o de recursos naturais renovaveis 
        e desenvolvimento, Paulo Freire Vieira e Jacques Weber (orgs.), Cortez 
        Editora, S&atilde;o Paulo.</P>
      <!--#include virtual="/include/copyright_fr.inc" --> </TD> 
		  <TD WIDTH="15" VALIGN="top" BGCOLOR="#FFFFFF"> 
			 <DIV ALIGN="right"></DIV> </TD> 
		</TR> 
	 </TABLE> </BODY>
</HTML>
