<!DOCTYPE HTML PUBLIC "-//SoftQuad Software//DTD HoTMetaL PRO 6.0::19990601::extensions to HTML 4.0//EN" "hmpro6.dtd">
<HTML> 
  <HEAD>
	 <META NAME="KeyWords"
	  CONTENT="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">
	 
	 <TITLE> Les diff&eacute;rents types de mod&egrave;les</TITLE>
	 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">

<!--#include virtual="/include/script.inc" -->
	 <LINK REL="stylesheet" HREF="/css/cormas.css"> 
  </HEAD> 
  <BODY MARGINWIDTH="0" MARGINHEIGHT="0" TOPMARGIN="0" LEFTMARGIN="0"
  ONLOAD="MM_preloadImages('/images/fr/accueil_r.gif','/images/fr/demarche_r.gif','/images/fr/logiciel_r.gif','/images/fr/applications_r.gif','/images/fr/biblio_r.gif','/images/fr/formation_r.gif','/images/fr/reseaux_r.gif')"
  BGCOLOR="#FFFFFF">
<!--#include virtual="haut.inc" -->
	 <TABLE CELLSPACING="0" CELLPADDING="0" BORDER="0" WIDTH="100%"> 
		<TR>
    <!--#include virtual="sommair.inc" -->
		  <TD WIDTH="*" VALIGN="top" BGCOLOR="#FFFFFF"> 
			 <P>&nbsp;</P>
			 <P> </P>
			 
      <H1> Les différents types de modèles</H1> 
			 
      <P>&nbsp;</P>
      <P>La plupart des recherches sur les ressources naturelles utilisent la 
        mod&eacute;lisation et la simulation. Les finalit&eacute;s sont diverses 
        : le mod&egrave;le peut &ecirc;tre utilis&eacute; &agrave; des fins de 
        contr&ocirc;le et de pr&eacute;diction ou &agrave; des fins de compr&eacute;hension 
        et de confrontation de points de vue.</P> 
			 <P>Les recherches sur les biens communs s'int&eacute;ressent le plus
				souvent &agrave; la <B>th&eacute;orie des jeux</B>, qui permet de
				repr&eacute;senter des individus, des comportements et des interactions. De
				leur c&ocirc;t&eacute;, les outils &eacute;conomiques de gestion s'appuient le
				plus souvent sur une mod&eacute;lisation de type <B>syst&egrave;mes
				dynamiques</B> pour repr&eacute;senter les flux de mati&egrave;re
				d'&eacute;nergie, d'information ou de monnaie. Enfin l'approche
				r&eacute;gionale fait des <B>syst&egrave;mes d'information
				g&eacute;ographique</B> (Sig) son outil central de mod&eacute;lisation.</P> 
			 <P>La vocation de ces communaut&eacute;s de chercheurs est de mettre
				l'accent sur<B> l'interaction et l'int&eacute;gration </B>(entre les
				disciplines scientifiques, entre les &eacute;chelles, entre les niveaux
				d'int&eacute;gration, entre les dynamiques naturelles et sociales, entre des
				pas de temps). Le but est de mieux comprendre et de mieux agir.</P> 
			 <P>Cette d&eacute;marche fait appel aux <B>sciences de la
				complexit&eacute;</B> (Lewin, 1994 ; Gell-Mann, 1994). De nombreuses recherches
				utilisent les m&eacute;thodes de mod&eacute;lisation d&eacute;velopp&eacute;es
				dans les sciences de la complexit&eacute;. Il s'agit de mod&eacute;lisations de
				la dynamique des interactions, comme les <B>syst&egrave;mes multi-agents</B> ou
				les <B>automates cellulaires</B>.</P> 
			 
      <P>Des instituts comme le World Resource Institute, le Macaulay Land Use 
        Research Institute, l'Unesco, l'Iee (International Institute for Ecological 
        Economics) d&eacute;veloppent des outils de mod&eacute;lisation de la 
        dynamique des interactions. En France, des instituts comme le Cemagref, 
        l'Inra, l'Ird, le Cnrs et, bien s&ucirc;r, le Cirad se sont aussi engag&eacute;s 
        dans cette voie. </P> 
			 
      <H2>R&eacute;f&eacute;rences</H2> 
			 <P>Gell-Mann M. 1994. Le quark et le jaguar. Voyage au c&#156;ur du
				simple et du complexe. Albin Michel Sciences, Paris.</P> 
			 <P>Lewin R. 1994. La complexit&eacute;. Une th&eacute;orie de la vie
				au bord du chaos. InterEditions, Paris</P>
   
    <!--#include virtual="/include/copyright_fr.inc" -->
		  </TD> 
		  <TD WIDTH="15" VALIGN="top" BGCOLOR="#FFFFFF"> 
			 <DIV ALIGN="right"></DIV> </TD> 
		</TR> 
	 </TABLE> </BODY>
</HTML>
