<!DOCTYPE HTML PUBLIC "-//SoftQuad Software//DTD HoTMetaL PRO 6.0::19990601::extensions to HTML 4.0//EN" "hmpro6.dtd">
<HTML> 
  <HEAD>
	 <META NAME="KeyWords"
	  CONTENT="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">
	 
	 <TITLE>Les Syst&egrave;mes Multi-Agents</TITLE>
	 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">

<!--#include virtual="/include/script.inc" -->
	 <LINK REL="stylesheet" HREF="/css/cormas.css"> 
  </HEAD> 
  <BODY MARGINWIDTH="0" MARGINHEIGHT="0" TOPMARGIN="0" LEFTMARGIN="0"
	ONLOAD="MM_preloadImages('/images/fr/accueil_r.gif','/images/fr/demarche_r.gif','/images/fr/logiciel_r.gif','/images/fr/applications_r.gif','/images/fr/biblio_r.gif','/images/fr/formation_r.gif','/images/fr/reseaux_r.gif')"
	BGCOLOR="#FFFFFF">
<!--#include virtual="haut.inc" -->
	 <TABLE CELLSPACING="0" CELLPADDING="0" BORDER="0" WIDTH="100%"> 
		<TR> <!--#include virtual="sommair.inc" -->
		  <TD WIDTH="*" VALIGN="top" BGCOLOR="#FFFFFF"> 
			 <P>&nbsp; </P>
			 <P> </P>
			 <H1> Les syst&egrave;mes multi-agents</H1> 
			 <H2>Pr&eacute;sentation g&eacute;n&eacute;rale</H2> 
			 <P ALIGN="left"><B>Les syst&egrave;mes multi-agents cherchent
				&agrave; appr&eacute;hender la coordination de processus autonomes.</B> </P> 
			 <P ALIGN="left">Pour Weiss (1999), un <B>agent</B> est une
				"entit&eacute; computationnelle", comme un programme informatique ou un robot,
				qui peut &ecirc;tre vue comme percevant et agissant de fa&ccedil;on autonome
				sur son environnement. On peut parler d'autonomie parce que son comportement
				d&eacute;pend au moins partiellement de son exp&eacute;rience. Un
				syst&egrave;me multi-agents (Sma) est constitu&eacute; d'un ensemble de
				processus informatiques se d&eacute;roulant en m&ecirc;me temps, donc de
				plusieurs agents vivant aum&ecirc;me moment, partageant des ressources communes
				et communicant entre eux. Le point cl&eacute; des syst&egrave;mes multi-agents
				r&eacute;side dans la formalisation de la <B>coordination</B> entre les agents.
				La recherche sur les agents est ainsi une recherche sur :</P> 
			 <OL> 
				<LI><B>la d&eacute;cision</B> -quels sont les m&eacute;canismes de
				  la d&eacute;cision de l'agent? Quelle est la relation entre les perceptions,
				  les repr&eacute;sentations et les actions des agents ? Comment
				  d&eacute;composent-ils leurs buts et t&acirc;ches ? Comment construisent-ils
				  leurs repr&eacute;sentations ?</LI> 
				<LI><B>le contr&ocirc;le</B> - quelles sont les relations entre les
				  agents?, Comment sont-ils coordonn&eacute;s ? Cette coordination peut
				  &ecirc;tre d&eacute;crite comme une coop&eacute;ration pour accomplir une
				  t&acirc;che commune ou comme une n&eacute;gociation entre des agents ayant des
				  int&eacute;r&ecirc;ts diff&eacute;rents.</LI> 
				<LI><B>la communication</B> - quels types de message
				  s'envoient-ils? &agrave; quelle syntaxe ob&eacute;issent ces messages?
				  Diff&eacute;rents protocoles sont propos&eacute;s en fonction du type de
				  coordination entre les agents.</LI> 
			 </OL> 
			 <P>Les syst&egrave;mes multi-agents ont des applications dans le
				domaine de l'intelligence artificielle o&ugrave; ils permettent de
				r&eacute;duire la complexit&eacute; de la r&eacute;solution d'un
				probl&egrave;me en divisant le savoir n&eacute;cessaire en sous-ensembles, en
				associant un agent intelligent ind&eacute;pendant &agrave; chacun de ces
				sous-ensembles et en coordonnant l'activit&eacute; de ces agents (Ferber,
				1995). On parle ainsi d'intelligence artificielle distribu&eacute;e. </P> 
			 <P>Cette m&eacute;thode s'applique, par exemple, pour la surveillance
				d'un processus industriel o&ugrave; elle met en oeuvre la solution de bon sens
				qui consiste &agrave; coordonner plusieurs surveillants
				sp&eacute;cialis&eacute;s, plut&ocirc;t qu'&agrave; envisager un seul
				surveillant omniscient.</P> 
			 <P> Les recherches fondamentales concernent la repr&eacute;sentation
				de la d&eacute;cision des agents, ou les protocoles de communication. Elles
				s'appliquent principalement aux t&eacute;l&eacute;communications, &agrave;
				l'Intemet avec le commerce &eacute;lectronique, &agrave; des agents physiques
				tels les robots, &agrave; l'optimisation des syst&egrave;mes de transports et
				&agrave; la gestion de fili&egrave;res. Il existe une communaut&eacute; de
				chercheurs qui s'int&eacute;ressent aux simulations de soci&eacute;t&eacute;s
				d'agents, en &eacute;cologie ou en sciences sociales.</P> 
			 <H2>Evolution de la recherche sur les syst&egrave;mes
				multi-agents</H2> 
			 <P>En Europe, et en France en particulier, la communaut&eacute; Sma
				est issue de la rencontre de chercheurs de plusieurs disciplines, contrairement
				aux Etats-Inis o&ugrave; l'intelligence artificielle distribu&eacute;e s'est
				d&eacute;velopp&eacute;e sous l'&eacute;gide des informaticiens,
				s&eacute;par&eacute;ment du domaine de la vie artificielle initi&eacute; par
				les physiciens. Dans le cadre g&eacute;n&eacute;ral des sciences de la
				complexit&eacute;, qui proposent les interactions entre des entit&eacute;s
				&eacute;l&eacute;mentaires et leurs organisations dans une d&eacute;marche
				ascendante, les Sma vont amoncer un double mouvement. D'une part ils
				catalyseront la reformulation de certaines questions en sciences sociales ou en
				sciences de la nature, d'autre part ils aideront &agrave; pr&eacute;ciser les
				questions et &agrave; proposer de nouveaux concepts informatiques. </P> 
			 <P>C'est ainsi, par exemple, que les Sma pos&egrave;rent dans un
				premier temps la question de la <B>d&eacute;cision</B> chez les agents, s'en
				allant interroger la psychologie cognitive et la th&eacute;orie des jeux avant
				d'aborder, dans un second temps, la question de <B>l'interaction</B> entre les
				agents pour construire des soci&eacute;t&eacute;s artificielles, convoquant
				alors les sociologues ou bien les linguistes. Une des questions actuelles est
				celle de <B>l'environnement</B> des agents.</P> 
			 <H2>Syst&egrave;mes multi-agents et simulation de
				soci&eacute;t&eacute;</H2> 
			 <P>G&eacute;n&eacute;ralement l'application des syst&egrave;mes
				multi-agents &agrave; la simulation de ph&eacute;nom&egrave;nes sociaux est
				associ&eacute;e au courant sociologique dit de l'individualisme qui
				consid&egrave;re l'individu singulier comme l'unit&eacute;
				&eacute;l&eacute;mentaire, comme l'atome de la soci&eacute;t&eacute;. </P> 
			 <P> Cependant, l'assimilation entre individus d'une
				soci&eacute;t&eacute; et agents d'un univers multi-agents peut &ecirc;tre
				trompeuse : il est tout &agrave; fait possible de consid&eacute;rer comme
				agents des groupes sociaux ou des institutions donn&eacute;es, avec leurs
				r&egrave;gles de fonctionnement, leurs normes. Les agents sont conduits par des
				contraintes, des r&egrave;gles exprim&eacute;es au niveau du groupe: ils ne
				sont plus que des entit&eacute;s agissantes, que l'on place dans un
				environnement dynamique. Cette simple remarque, naturelle d&egrave;s que l'on
				envisage une mod&eacute;lisation par un syst&egrave;me multi-agent indique
				comment la dualit&eacute; simple entre l'individualisme et le holisme peut
				&ecirc;tre remise en cause, ce qui est une pr&eacute;occupation majeure des
				chercheurs qui &eacute;tudient la gestion des ressources renouvelables et des
				chercheurs sur les syst&egrave;mes multi-agents:</P> 
			 <UL TYPE="square"> 
				<LI>les <B>individus</B>, produits d'une histoire sont mus par des
				  valeurs et des r&egrave;gles collectives, </LI> 
				<LI>les <B>valeurs et r&egrave;gles collectives</B> &eacute;voluent
				  par interaction entre individus, mais aussi entre groupes, </LI> 
				<LI>les individus ne sont ni semblables ni &eacute;gaux, mais
				  porteurs de <B>r&ocirc;les et statuts sociaux</B>. </LI> 
			 </UL> 
			 <P>Comment les individus construisent ils ce collectif ? Comment se
				cr&eacute;e une institution ? En retour l'individu ne peut &ecirc;tre
				consid&eacute;r&eacute; comme une entit&eacute; autonome ind&eacute;pendante de
				son environnement social. Comment les individus sont-ils contraints par les
				structures collectives qu'ils se sont donn&eacute;es et comment les font-ils
				&eacute;voluer ? Quels sont les degr&eacute;s de libert&eacute; &agrave;
				l'int&eacute;rieur desquels se meuvent les pratiques individuelles ? Voici,
				entre autres, des questions que les Sma permettent d'explorer, dans les termes
				suivants : "Comment se cr&eacute;ent et fonctionnent des structures collectives
				&agrave; partir d'agents qui ont de plus ou moins grandes capacit&eacute;s de
				repr&eacute;sentations, qui &eacute;changent entre autres des informations, des
				services ou des biens, qui &eacute;laborent des contrats et qui sont
				plong&eacute;s dans un environnement dynamique qui r&eacute;agit &agrave; leurs
				actions ? ". </P> 
			 <H2>Syst&egrave;mes multi-agents et simulation de la gestion des
				ressources</H2> 
			 <P>La simulation de la gestion de ressources communes pose le
				probl&egrave;me de l'interaction entre des ensembles d'agents et des ressources
				dynamiques. </P> 
			 <UL> 
				<LI TYPE="square">Une premi&egrave;re fa&ccedil;on d'aborder la
				  mod&eacute;lisation de ces interactions met l'accent sur les processus qui
				  d&eacute;terminent l'interaction entre agents et ressources. Ces processus
				  peuvent &ecirc;tre cognitifs (chacun des agents se fait une
				  repr&eacute;sentation de la ressource) ou r&eacute;actifs. L'important est que
				  chaque agent agit sur la ressource en cons&eacute;quence de ses r&egrave;gles
				  ou d&eacute;cisions. Ce faisant, il transforme cette ressource pour les autres.
				  Cette mod&eacute;lisation se rapproche de ce que les &eacute;conomistes
				  appellent externalit&eacute;s. On &eacute;tudie un probl&egrave;me de gestion
				  des ressources renouvelables communes en confrontant des
				  repr&eacute;sentations, donc des actions diff&eacute;rentes, qui peuvent donner
				  lieu &agrave; un usage satisfaisant ou non, pour l'ensemble des agents. On peut
				  parler de <B>coordination par l'environnement</B>. </LI> 
				<LI>Le deuxi&egrave;me mode consiste &agrave; consid&eacute;rer que
				  les relations entre les hommes et les ressources doivent plut&ocirc;t
				  &ecirc;tre formul&eacute;es comme <B>les relations entre les hommes &agrave;
				  propos des ressources</B>. Les univers multi-agents permettent de simuler des
				  agents qui s'&eacute;changent des messages au sein de r&eacute;seaux, dits
				  r&eacute;seaux d'accointances. Il est ainsi possible de simuler des
				  &eacute;changes d'informations, des &eacute;changes de services, des contrats,
				  des agr&eacute;ments entre les agents. </LI> 
				<LI>Enfin, nous proposons d'envisager un troisi&egrave;me mode de
				  mod&eacute;lisation des interactions entre les groupes d'agents et les
				  ressources communes. Nous proposons, pour aller plus loin dans la
				  caract&eacute;risation de la boucle individu-soci&eacute;t&eacute;, de passer
				  par la repr&eacute;sentation d'objets "m&eacute;diateurs " ou de
				  <B>"r&eacute;f&eacute;rents communs"</B>. Il s'agit des objets dont la
				  repr&eacute;sentation est &agrave; la fois individuelle et partag&eacute;e, qui
				  tendent &agrave; la fois &agrave; cr&eacute;er le groupe social et &agrave;
				  &ecirc;tre l'expression de son existence. M&eacute;moire collective, mythes,
				  march&eacute;s, divinit&eacute;s, lieux ou biens symboliques : autant d'objets
				  que les hommes construisent en permanence, autant de perceptions qui orientent
				  ou contraignent les pratiques des hommes. A travers la perception de ces objets
				  chaque agent se per&ccedil;oit comme membre du tout et contribue ainsi &agrave;
				  la cr&eacute;ation ou au maintien de ce tout. Il y a r&eacute;ification, non
				  pas du collectif, comme le voudrait un point de vue holiste, mais des objets
				  qui sont le signe du collectif. Plus pr&eacute;cis&eacute;ment on pourra
				  limiter, dans un premier temps, le concept d'objet m&eacute;diateur &agrave; la
				  repr&eacute;sentation d'institutions. </LI> 
			 </UL> 
			 <P>En r&eacute;sum&eacute;, il nous semble que les syst&egrave;mes
				multi-agents peuvent prendre en compte plusieurs mod&egrave;les de
				pens&eacute;es sur la gestion collective de ressources renouvelables communes.
				Offrant la possibilit&eacute; de mod&eacute;liser des repr&eacute;sentations,
				des modes de communication au sein de r&eacute;seaux, des contr&ocirc;les
				individuels ou sociaux, donn&eacute;s ou construits, des interactions, les
				syst&egrave;mes multi-agents sont ad&eacute;quats &agrave; la simulation de
				formes de coordination observables sur le terrain. </P> 
			 <H2>R&eacute;f&eacute;rences</H2> 
			 <P>Bousquet, F. 2001. Mod&eacute;lisation d'accompagnement.
				Simulations multi-agents et gestion des ressources naturelles et renouvelables.
				M&eacute;moire d'habilitation &agrave; diriger des recherches,
				Universit&eacute; de Lyon 1.</P> 
			 <P>Ferber, J. 1995. Les syst&egrave;mes multi-agents. Vers une
				intelligence collective. InterEditions, Paris.</P> 
			 <P>Weiss, G., (Ed.), 1999. Multiagent Systems. A Modern Approach to
				Distributed Artificial Intelligence, The MIT Press, Cambridge,
				Massachusetts.</P>
      <!--#include virtual="/include/copyright_fr.inc" --> </TD> 
		  <TD WIDTH="15" VALIGN="top" BGCOLOR="#FFFFFF"> 
			 <DIV ALIGN="right"></DIV> </TD> 
		</TR> 
	 </TABLE> </BODY>
</HTML>
