<html>
<head>
<meta name="KeyWords" content="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">
<title> Présentation de la formation Cormas</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<!--#include virtual="/include/script.inc" -->
<link rel="stylesheet" href="/css/cormas.css" -->
</head>
<body  marginwidth="0" marginheight="0" topmargin="0" leftmargin="0" border="0" onLoad="MM_preloadImages('/images/fr/accueil_r.gif','/images/fr/demarche_r.gif','/images/fr/logiciel_r.gif','/images/fr/applications_r.gif','/images/fr/biblio_r.gif','/images/fr/formation_r.gif','/images/fr/reseaux_r.gif')" bgcolor="#FFFFFF">
<!--#include virtual="haut.inc" -->
<table cellspacing="0" cellpadding="0" border="0" width="100%">
<tr>
    <!--#include virtual="sommair.inc" --> 
    <td width="*" valign="top" bgcolor="#FFFFFF"> 
      <p>&nbsp; 
      <p> 
      <h1>Pr&eacute;sentation de la formation Cormas</h1>
      <h2>Objectifs</h2>
      <p>L'objectif de ce stage est de fournir une initiation aux syst&egrave;mes 
        multi-agents appliqu&eacute;s aux probl&egrave;mes de simulation et de 
        gestion des ressources renouvelables. Apr&egrave;s la formation, les stagiaires 
        connaissent un &eacute;tat de l'art g&eacute;n&eacute;ral sur la mod&eacute;lisation 
        pour la gestion des ressources renouvelables, ont un panorama des diff&eacute;rents 
        domaines d'application des syst&egrave;mes multi-agents et ont une connaissance 
        approfondie des m&eacute;thodes de simulation multi-agents pour la gestion 
        des ressources renouvelables. Les stagiaires ont par ailleurs acquis une 
        pratique de la mod&eacute;lisation et ont la possibilit&eacute; de poursuivre 
        leur pratique en utilisant l'environnement de simulation Cormas qui est 
        mis &agrave; leur disposition &agrave; la fin de la formation.</p>
      <p>Un des objectifs de la formation consiste en effet &agrave; rendre les 
        stagiaires op&eacute;rationnels en mati&egrave;re d'utilisation de la 
        plate-forme de simulation qu'ils auront d&eacute;couvert lors des deux 
        semaines : &agrave; leur retour dans leur laboratoire, ils peuvent poursuivre 
        la construction de leur prototype de simulateur multi-agents.</p>
      <h2>Public</h2>
      <p>Ce stage s'adresse :</p>
      <ul>
        <li>aux mod&eacute;lisateurs ou informaticiens d&eacute;sireux de s'ouvrir 
          aux syst&egrave;mes multi-agents;</li>
        <li>aux chercheurs concern&eacute;s par la gestion de l'environnement 
          et sensibilis&eacute;s &agrave; la mod&eacute;lisation.</li>
      </ul>
      <h2>Programme</h2>
      <p>Le programme du stage s'articule autour de trois axes:</p>
      <ul>
        <li>des cours chaque matin, qui dans un premier temps proposent un panorama 
          des types de mod&eacute;lisation qui sont utilis&eacute;es dans le domaine 
          de la gestion des ressources, puis dans un deuxi&egrave;me temps qui 
          se concentrent sur la pr&eacute;sentation des syst&egrave;mes multi-agents,</li>
        <li>des travaux pratiques d&eacute;di&eacute;s &agrave; l'apprentissage 
          d'un langage orient&eacute;-objet (Smalltalk) et d'un environnement 
          de simulation multi-agent (Cormas) sont programm&eacute;s les apr&egrave;s-midi 
          de la premi&egrave;re semaine,</li>
        <li>des travaux personnels pour, &agrave; partir d'un cas concret, choisi 
          par les stagiaires, concevoir un syst&egrave;me multi-agents, et l'impl&eacute;menter 
          &agrave; l'aide de la plate-forme de simulation Cormas (apr&egrave;s-midi 
          de la seconde semaine).</li>
      </ul>
      <h2>P&eacute;dagogie</h2>
      <p>Une documentation sp&eacute;cialis&eacute;e (support de cours et manuel 
        d'utilisation de la plate-forme Cormas) est fournie &agrave; chaque participant.</p>
      <p>La deuxi&egrave;me semaine laisse une part importante aux travail personnel 
        : par petit groupe de deux ou trois personnes, des mod&egrave;les sont 
        con&ccedil;us puis impl&eacute;ment&eacute;s (avec l'aide des formateurs) 
        sur la plate-forme Cormas. Le stage se termine par une demi-journ&eacute;e 
        consacr&eacute;e &agrave; la pr&eacute;sentation de ces mod&egrave;les.</p>
      <h2>Formateurs</h2>
      <ul>
        <li>Martine Antona, &eacute;conomiste, mod&eacute;lisatrice;</li>
        <li>Pierre Bommel, informaticien, mod&eacute;lisateur, simulation multi-agents;</li>
        <li>Fran&ccedil;ois Bousquet, mod&eacute;lisateur, simulation multi-agents, 
          responsable p&eacute;dagogique;</li>
        <li>Christophe Le Page, mod&eacute;lisateur, simulation multi-agents, 
          simulation individus-centr&eacute;e;</li>
        <li>Jean-Pierre M&uuml;ller, informaticien, mod&eacute;lisateur, simulation 
          multi-agents; </li>
        <li>Guy Tr&eacute;buil, agronome, mod&eacute;lisateur;</li>
        <li>Intervenants ext&eacute;rieurs 
          <ul>
            <li>Olivier Barreteau (CEMAGREF);</li>
            <li>Raphael Mathevet (CNRS);</li>
            <li>Michel Etienne (INRA).</li>
          </ul>
        </li>
      </ul>
      <!--#include virtual="/include/copyright_fr.inc" --> </td>
    <td width="15" valign="top" bgcolor="#FFFFFF"> 
    <div align="right" class="texte"></div>
    </td>
  </tr>
</table>
</body>
</html>
