<html>

<head>

<meta name="KeyWords" content="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">

<title>Ecole d'&eacute;t&eacute; &quot;impl&eacute;mentation de mod&egrave;les multi-agents d&eacute;di&eacute;s &agrave; la gestion des ressources renouvelables&quot; - Septembre 2012, Montpellier</title>

<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">



<!--#include virtual="/include/script.inc" -->

<link rel="stylesheet" href="/css/cormas.css" -->

</head>

<body  marginwidth="0" marginheight="0" topmargin="0" leftmargin="0" border="0" onLoad="MM_preloadImages('/images/en/accueil_r.gif','/images/en/demarche_r.gif','/images/en/logiciel_r.gif','/images/en/applications_r.gif','/images/en/biblio_r.gif','/images/en/formation_r.gif','/images/en/reseaux_r.gif')" bgcolor="#FFFFFF">

<!--#include virtual="haut.inc" -->

<table cellspacing="0" cellpadding="0" border="0" width="100%">

<tr>

    <!--#include virtual="sommair.inc" --> 
    <td width="*" valign="top" bgcolor="#FFFFFF"> 
      <p>&nbsp;</p>
      <h1>Ecole d'&eacute;t&eacute; internationale &quot;Designing, Implementing 
        and Running Agent-Based Models for Renewable Resources Management&quot;<br>
      </h1>
      <h1>Montpellier, du 17 au 28 septembre 2012<br>
      </h1>
      <h2>Contenu</h2>
      <p>Les sessions du matin prendront la forme de s&eacute;ances collectives 
        au cours desquelles les principes de la conception, de l'impl&eacute;mentation 
        et de la simulation de mod&egrave;les multi-agents seront enseign&eacute;s. 
        Des points sp&eacute;cifiques seront approfondis selon les attentes et 
        demandes des participants. Les sessions de l'apr&egrave;s-midi seront 
        consacr&eacute;es &agrave; des travaux personnels: les participants recevront 
        un appui de la part des formateurs dans le d&eacute;veloppement et la 
        mise au point de leur propre mod&egrave;le multi-agent. Le programme pr&eacute;visionnel 
        est d&eacute;taill&eacute; <a href="ABLS-SS-2012_TentativeProgramme.pdf" target="_blank">ici</a></p>
      <h2>Outils</h2>
      <p>Des temps sp&eacute;cifiques d'apprentissage du langage graphique <a href="http://www.uml.org/" target="_blank">UML</a> 
        ainsi que d'introduction aux plateformes <a href="http://cormas.cirad.fr/fr/outil/presentation/" target="_blank">Cormas</a>, 
        <a href="http://mimosa.sourceforge.net/" target="_blank">Mimosa</a> et 
        <a href="http://ccl.northwestern.edu/netlogo/" target="_blank">NetLogo</a> 
        (sur la base d'une d&eacute;monstration d'un m&ecirc;me mod&egrave;le) 
        seront propos&eacute;s. Il est demand&eacute; aux participants d'indiquer 
        dans la fiche d'inscription (cf. ci-dessous) laquelle de ces trois plateformes 
        ils se destinent &agrave; utiliser lors des s&eacute;ances de travail 
        sur les projets personnels, afin de faciliter l'organisation de ces s&eacute;ances 
        d'appui personalis&eacute;.</p>
      <h2>Formateurs</h2>
      <p>G&eacute;raldine Abrami (Irstea), Nicolas Becu (CNRS-Prodig), Pierre 
        Bommel, Fran&ccedil;ois Bousquet, Christophe Le Page, Jean-Pierre M&uuml;ller, 
        Cyril Piou (CIRAD) </p>
      <h2>Inscription</h2>
      <p>Compl&eacute;ter et renvoyer la fiche <a href="RegFormSept2012.doc" target="_blank"><img src="../../images/doc.jpg" width="16" height="16" border="0"></a> 
        &agrave; <a href="mailto:le_page@cirad.fr" target="_blank">christophe.le_page@cirad.fr</a> 
        avant le 14 juillet 2012 (les coups de canon de la Bastille faisant foi). 
        La s&eacute;lection des participants sera annonc&eacute;e le 31 juillet.</p>
      <h2>Frais p&eacute;dagogiques</h2>
      <h2></h2>
      <ul>
        <li>Etudiants: 500 &euro;</li>
        <li>Chercheurs: 1000 &euro;</li>
      </ul>
      <p>Ces frais d'inscriptions incluent les pauses caf&eacute;/th&eacute; ainsi 
        qu'un repas de gala. Les d&eacute;jeuners le midi &agrave; la cantine 
        du CIRAD du campus de Baillarguet co&ucirc;tent environ 3&euro;. Les frais 
        d'h&eacute;bergement et de transport sont &agrave; la charge des participants.</p>
      <p>Pour toute demande d'information suppl&eacute;mentaire, contacter <a href="mailto:le_page@cirad.fr" target="_blank">christophe.le_page@cirad.fr</a></p>
      <!--#include virtual="/include/copyright_en.inc" --> </td>

    <td width="15" valign="top" bgcolor="#FFFFFF"> 

    <div align="right" class="texte"></div>

    </td>

  </tr>

</table>

</body>

</html>

