<html>

<head>

<meta name="KeyWords" content="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">

<title>Theses and working papers</title>

<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">



<!--#include virtual="/include/script.inc" -->

<link rel="stylesheet" href="/css/cormas.css" -->

</head>

<body  marginwidth="0" marginheight="0" topmargin="0" leftmargin="0" border="0" onLoad="MM_preloadImages('/images/en/accueil_r.gif','/images/en/demarche_r.gif','/images/en/logiciel_r.gif','/images/en/applications_r.gif','/images/en/biblio_r.gif','/images/en/formation_r.gif','/images/en/reseaux_r.gif')" bgcolor="#FFFFFF">

<!--#include virtual="haut.inc" -->

<table cellspacing="0" cellpadding="0" border="0" width="100%">

<tr>

    <!--#include virtual="sommair.inc" --> 

    <td width="*" valign="top" bgcolor="#FFFFFF"> 

 <p>&nbsp;</p>

      <h1>Theses and working papers</h1>

      <h2>2011</h2>
      <p>Jorge Corral. 2011. Agent-based Methodology for Developing Agroecosystems' 
        Simulations. Master thesis from Udelar, Universidad de la Rep&uacute;blica, 
        Facultad de Ingenier&iacute;a. 2011, february. 112 pages. <a href="/pdf/MScThesis_JorgeCorral_2011.pdf" target="_blank"><img src="/images/renvoi.gif" width="14" height="14" border="0"></a></p>
      <h2>2008</h2>
      <p>Vieira Pak, M. 2008. O modelo transamazon: uma análise para melhorar 
        suas limitações por meio da participação social. Diserta&ccedil;&atilde;o 
        de Mestrado da Universidade de Bras&iacute;lia, Centro de Desenvolvimento 
        Sustentavel. 182 pages. <a href="/pdf/MESTRADO_MVP_CDS_UNB_2008.pdf" target="_blank"><img src="/images/renvoi.gif" width="14" height="14" border="0"></a></p>
      <h2>2007</h2>
      <p>Bont&eacute;, B. 2007. L'anticipation dans les systèmes multiagents destinés 
        à la modélisation de phénomènes sociaux complexes Application à la modélisation 
        des fronts pionniers amazonniens. Mémoire de Master II « Intelligence 
        Artificielle et Décision » de l'universit&eacute; de Paris 6., 41 pages 
        + annexes <a href="/pdf/RapportM2Bonte.pdf" target="_blank"><img src="/images/renvoi.gif" width="14" height="14" border="0"></a></p>
      <p>Dupont, H. 2007. Mod&eacute;lisation multi-agents de l'impact du tourisme sur l'&icirc;le d'Ouessant. M&eacute;moire de deuxi&egrave;me ann&eacute;e de Master mention &quot;Ecologie Biodiversit&eacute; Evolution&quot;, 
      sp&eacute;cialit&eacute; &quot;Ing&eacute;nierie Ecologique et Gestion des Ecosyst&egrave;mes&quot;, Paris, 33 pages + annexes <a href="http://www.commod.org/pdf/masterDupont2007.pdf" target="_blank"><img src="/images/renvoi.gif" width="14" height="14" border="0"></a></p>
      <h2>2006</h2>
      <p>Bourgeois, M. 2006. N&icirc;metPasLeFeu, un outil d'aide &agrave; la d&eacute;cision pour la pr&eacute;vention des incendies de for&ecirc;t dans le milieu p&eacute;riurbain n&icirc;mois. M&eacute;moire INA-PG Paris. <a href="http://www.commod.org/pdf/memoireMBourgeois.pdf" target="_blank"><img src="/images/renvoi.gif" width="14" height="14" border="0"></a></p>
      <p>Echeverria J., 2006. Mod&eacute;lisation d'accompagnement et gestion des probl&egrave;mes de ruissellement &eacute;rosif en Haute Normandie. M&eacute;moire du Master Economie du D&eacute;veloppement Durable, de l'Environnement et de l'Energie (EDDEE) Universit&eacute; Paris X Nanterre, 100 pages + annexes <a href="http://www.commod.org/pdf/Rapport_JavierEcheverria.pdf" target="_blank"><img src="/images/renvoi.gif" width="14" height="14" border="0"></a></p>
      <p><b><i><font color="#666666" size="4">2005</font></i></b></p>
      <p>Belem M. 2005. Couplage entre système multi-agents et programmation mathématique 
        : application à la simulation de la dynamique des ressources en carbone 
        d’un terroir au Burkina-Faso. M&eacute;moire de DEA 'Informatique: syst&egrave;mes 
        intelligents&quot; de l’Université Paris Dauphine, France. <a href="/pdf/deaBelem.pdf" target="_blank"><img src="/images/renvoi.gif" width="14" height="14" border="0"></a></p>
      <p>Dionnet, M. 2005. Pour une gestion paysanne de l’agrobiodiversité : le 
        cas du sorgho au Mali. Mémoire de DESS &quot;Espace et Milieux&quot;, 
        Universit&eacute; Paris 7 - Denis Diderot, France. <a href="/pdf/dessDionnet.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Lorrilli&egrave;re R. 2005. Recolonisation du H&eacute;ron cendr&eacute; 
        <i>Ardea cinerea </i>en France subs&eacute;quente &agrave; sa mise en 
        protection: mod&eacute;lisation dans un automate cellulaire. M&eacute;moire 
        de Master 2 &quot;Evolution, Patrimoine Naturel et Soci&eacute;t&eacute;s&quot; 
        du Mus&eacute;um National d'Histoire Naturelle, Paris, France. <a href="/pdf/masterLorrilliere.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Perez, P. and Dray, A. 2005. Monograph No. 11: SimDrug: Exploring the 
        complexity of heroin use in Melbourne. DPMP Monograph Series. Fitzroy: 
        Turning Point Alcohol and Drug Centre. <a href="/pdf/simDrug.pdf" target="_blank"><img src="/images/renvoi.gif" width="14" height="14" border="0"></a></p>
      <p>Worrapimphong, Kobchai 2005. Companion modelling for razor clam Solen 
        regularis conservation at Don Hoi Lord, Samut Songkhram Province, Thailand, 
        Master of Science dissertation, Chulalongkorn University, Bangkok.<a href="/pdf/masterKobChai.zip" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p><b><i><font color="#666666" size="4">2004</font></i></b></p>
      <p>Barnaud, C. 2004. Erosion des sols et syst&egrave;mes agraires dans les 
        hautes terres du nord de la Tha&iuml;lande. Une approche de la complexit&eacute; 
        par une mod&eacute;lisation d'accompagnement. Mémoire de DEA Géographie 
        et pratique du développement, Ecole doctorale "Milieux, Cultures et Sociétés 
        du Passé et du Présent", Institut National Agronomique Paris-Grignon et 
        Université Paris X-Nanterre, France. <a href="/pdf/deaBarnaud.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Bont&eacute;, B. 2004. R&eacute;union de deux types de repr&eacute;sentation 
        de l'exploitation agricole (la repr&eacute;sentation syst&eacute;mique 
        et la mod&eacute;lisation multi-agents) &agrave; travers une liaison entre 
        les logiciels « Olympe » et « Cormas ». M&eacute;moire de troisième année 
        de l’école des Mines de Douai, France. <a href="/pdf/memoireIngeBonte.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Bouquier, D. 2004. Int&eacute;r&ecirc;t du paradigme Agent-Groupe-R&ocirc;le 
        pour la mod&eacute;lisation: application &agrave; la formalisation des 
        r&eacute;seaux d'approvisionnement. M&eacute;moire de DEA Informatique 
        (Ecole Doctorale Informatique, Structures et Syst&egrave;mes), Universit&eacute; 
        de Montpellier II, France. <a href="/pdf/deaBouquier.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Daniell, K.A, Kingsborough, A.B, Malovka, D.J., Sommerville, H.C., Foley, B.A., Maier, H.R. (2004), A Review of the Assessment of Sustainability of Housing Developments, Departmental Report No. R175, School of Civil and Environmental <br>
      Engineering, The University of Adelaide, Australia. <a href="http://www.%20civeng.adelaide.edu.au/research/reports/R175.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>      
      <p>Simon C., 2004. Approche multi-agents pour une gestion pastorale et foresti&egrave;re 
        concert&eacute;e: application aux espaces bois&eacute;s de la Soci&eacute;t&eacute; 
        Civile des Terres du Larzac. M&eacute;moire FIF-Engref Nancy. <a href="/pdf/fifSimon.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Gurung, T. 2004. Use of multi-agent simulation to improve irrigation 
        water-sharing in Lingmuteychu watershed (Bhutan). Master of Science in 
        Agricultural Systems. Chiang-Mai University. Thailand. <a href="/pdf/thesis_tayangurung_cmu.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Laperri&egrave;re, V. 2004. Modélisation multi-agents du changement de 
        pratiques viticoles. Mémoire de DEA Structures et Dynamiques Spatiales. 
        Universit&eacute; Joseph Fourier, Grenoble, France. <a href="/pdf/deaLaperriere.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>

      <p><b><i><font color="#666666" size="4">2003</font></i></b></p>
      <p>Campo, P. 2003. Multi-agent systems integrating GIS and remote sensing: 
        Tools for participatory natural resource management (prototype for Loon 
        in Bohol, The Philippines). Master of Science Thesis, Remote Sensing. 
        University of the Philippines, Diliman, Quezon City.<a href="/pdf/Thesis_PCampo_part1.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a><a href="/pdf/Thesis_PCampo_part2.pdf" target="_blank"> 
        <img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Fayein M., 2003. Elaboration d'un outil d'accompagnement de projets d'am&eacute;nagement 
        pour la pr&eacute;vention des incendies de for&ecirc;t. M&eacute;moire 
        INA-PG Paris. <a href="/pdf/daaFayein.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Lacombe, G. 2003. Compréhension des stratégies d’adaptation à la variabilité 
        des pluies en riziculture inondée par la modélisation Cas du bassin versant 
        de la Lam Dom Yaï, région Nord-est de la Thaïlande. Mémoire de DEA &quot;Sciences 
        de l’Eau dans l’Environnement Continental&quot;. Ecole Nationale du Génie 
        Rural, des Eaux et des Forêts - Université Montpellier II, France. <a href="/pdf/deaLacombe.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Ruffez, P. 2003. Etude de la n&eacute;gociation dans le cadre d'un jeu 
        de r&ocirc;les sur le sylvopastoralisme. M&eacute;moire de DEA &quot;Intelligence 
        Artificielle, Reconnaissance des Formes et Applications&quot; (IARFA), 
        universit&eacute; Paris 6, France. <a href="/pdf/deaRuffez.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p><b><i><font color="#666666" size="4">2002</font></i></b></p>
      <p>Dray A. 2002. Mod&eacute;lisation de la gestion des lentilles d'eau douces 
        sur South Tarawa &agrave; l'aide des Syst&egrave;mes Multi-Agents. Mémoire 
        de DAA de l'Ecole Nationale Sup&eacute;rieure d'Agronomie de Rennes, option 
        physique des surfaces naturelles et g&eacute;nie hydrologique. 65 pages. 
        <a href="/pdf/daaDray.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Gigot G. 2002. Contribution au d&eacute;veloppement d&#146;un jeu de 
        r&ocirc;le, bas&eacute; sur un mod&egrave;le de Simulation Multi-Agents, 
        appliqu&eacute; &agrave; la gestion des roseli&egrave;res et &agrave; 
        la conservation du Butor &eacute;toil&eacute; (Botaurus stellaris).Mémoire 
        de DAA de l'Ecole Nationale d'Agronomie de Paris-Grignon, option agronomie 
        et environnement. 74pages. <a href="/pdf/daaGigot.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Morshed Anwar, Sk., 2002. Land use change dynamics : a dynamic spatial 
        simulation. Master dissertation, Asian Institute of Technology, STAR school. 
      <a href="/pdf/Thesis_Morshed.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Parker, D., Berger, T. and Manson, S., editors. 2002. Agent-based models of land-use and land-cover change. LUCC Report Series, 6, Indiana University.</p>
      <p><b><i><font color="#666666" size="4">2001</font></i></b></p>
      <p>Becu N. 2001. Mod&eacute;lisation de la gestion de l'eau d'irrigation 
        &agrave; l'&eacute;chelle d'un bassin versant et exploration du syst&egrave;me 
        via simulations. Une approche basée sur les Systèmes Multi-Agents. Le 
        cas du bassin versant du Mae Uam – Nord-Thaïlande. Mémoire de DEA, Sciences 
        de l’Eau dans l’Environnement Continental ; Ecole Nationale du Génie Rural, 
        des Eaux et Forêts – Université Montpellier II. 128 pages + annexes. <a href="/pdf/becu.pdf"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p> Boissau, S.; Hoang Lan Anh; Castella, J.C. (2001). “Report on Samba role-play in Xuat Hoa commune, Bac Kan province.” SAM Paper Series 3, Vietnam Agricultural Science Institute, Hanoi. </p>      <p> Castella, J.-C.; Boissau, S.; Tran Ngoc Trung; Dang Dinh Quang (2001). "Consequences of lowland allocation process on upland agricultural dynamics in Northern Vietnam mountains: from systems analysis to multi-agent model." SAM Paper Series 4, Vietnam Agricultural Science Institute, Hanoi. </p>      <p>Cohen M., 2001. Gestion sylvopastorale des pins sur le Causse M&eacute;jan: une approche multi-agents du maintien des milieux ouverts. M&eacute;moire INA-PG Paris </p>
      <p>Estival J.-B. 2001. Simulation de la dynamique de la Péri-Pneumonie Contagieuse 
        Bovine (PPCB) en Ethiopie. Rapport de stage ISIMA (2eme année). 81 pages. 
        <a href="/pdf/isimajbe.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a> 
      </p>
      <p>Lardon L., 2001. Modélisation des biofilms de digestion anaérobie par 
        système multi-agents. Mémoire de Diplôme d'Agronomie Approfondie (DAA) 
        de l'Ecole Nationale Supérieure d'Agronomie de Montpellier. 79 pages. 
        <a href="/pdf/daall.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a> 
      </p>
      <p><b><i><font size="4" color="#666666">2000</font></i></b></p>
      <p>Antona, M., 2000. Régulation d'une filière d'exloitation d'une ressource 
        renouvelable: le bois énergie au Niger. Montpellier, Université Montpellier 
        1 - ENSAM. 90p.</p>
      <p>Appere, N., 2000. La modélisation et la simulation par automates cellulaires 
        et systèmes multi-agents: application aux pressions exercées sur le sol. 
        Orléans, Université d'Orléans. 41p.</p>
      <p>Bah, A., 2000. Les systèmes multi-agents génétiques: vers une société 
        d'agents génétiques.M&eacute;moire de DEA d'informatique, Université Cheikh 
        Anta Diop de Dakar, S&eacute;n&eacute;gal. 55p.</p>
      <p>Bakam, I., Kordon, F., Le Page, C. and Bousquet, F. 2000. Formalisation 
        de modèles multi-agents par les réseaux de Petri : Application à l’étude 
        d’un système de gestion de la chasse à l’Est-Cameroun. 8 p. <a href="/pdf/bakampetri.pdf"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a> 
      </p>
      <p>Valeix, M., 2000. Différentes approches en modélisation de dynamique 
        des populations. Paris, INA-PG, 28p. </p>

      <p><b><i><font color="#666666" size="4">1999</font></i></b></p>
      <p><a name="abrami"></a>Abrami, G., 1999. Modélisation multi-agents pour 
        l'aménagement forestier : Usages multiples dans l'écosystème forestier 
        de Didy. M&eacute;moire de DEA M&eacute;canique et Ing&eacute;nierie. 
        Ecole Nationale Sup&eacute;rieure de Physique de Strasbourg - Universit&eacute; 
        Louis Pasteur de Strasbourg. 58p. <a href="../../pdf/Abrami_DEA.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" alt="renvoi" border="0"></a></p>
      <p>Amblard, F., 1999. Modèles multi-agents pour la décision collective. 
        M&eacute;moire de DEA d'informatique, Université Montpellier II. 78 p. 
        <a href="/pdf/amblard.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" alt="renvoi" border="0"></a></p>
      <p>Becu, N., 1999. Importance du facteur social dans la gestion collective 
        de la ressource en eau, ESITPA. 45p.</p>
      <p>Bommel, P., 1999. Analyse et amélioration d'un modèle multi-agents. Application 
        à la modélisation des dynamiques sylvo-pastorales (modèle forpast). Rapport 
        de stage de DESS d'informatique IAO. Montpellier, Université Montpellier 
        II. 58p.</p>
      <p>Vagnini, A., 1999. Apport de la modélisation par couplage SIG-SMA au 
        développement "durable" de la moyenne vallée du Zambere: développement 
        méthodologique. Montpellier, Cirad, 30 p.</p>

      <p><b><i><font color="#666666" size="4">1998</font></i></b></p>
      <p>Boissau, S., 1998. Unifier Malthus et Boserup ? L'exemple de la relation 
        population-forêts. Formation doctorale Recherches comparatives sur le 
        développement. Paris, EHESS. 106p.</p>
      <p>Bouquet, F. and Antona, M., Participation à l'atelier développement et 
        gestion durable des filières d'exploitation des ressources de la biodiversité 
        à Madagascar. Madagascar. 29 p.</p>
      <p>Bousquet, F., 1998. Simulations multi-agents et systèmes d'information 
        géographiques. Madagascar - La Réunion. 8 p.</p>
      <p>Lieurain, M., 1998. Simulations distribu&eacute;es et multi-agents. M&eacute;moire 
        de DEA d'informatique, Université Montpellier II. 27 p. <a href="/pdf/lieuraindea.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Lieurain, M., 1998. Couplage SIG-SMA. Rapport technique, Montpellier, 
        Cirad Tera. 28 p. <a href="/pdf/lieurain.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p><b><i><font color="#666666" size="4">1997</font></i></b></p>
      <p>Bah, A. 1997. Simulation multi-agents des modes d'utilisation des ressources 
        en propri&eacute;t&eacute; commune; le cas de la mobilit&eacute; pastorale 
        en zone intertropicale s&egrave;che. Masters thesis. Ecole Sup&eacute;rieure 
        Polytechnique de Dakar.</p>
      <p><b><i><font color="#666666" size="4">1996</font></i></b></p>
      <p>Proton, H. 1996. Syst&egrave;mes multi-agents pour l'&eacute;tude de 
        l'organisation d'une soci&eacute;t&eacute; de chasseurs et d'agriculteurs 
        dans le cadre des ressources renouvelables. M&eacute;moire de DEA d'Informatique. 
        Universit&eacute; de Montpellier 2, Montpellier.</p>
      <p>Rouchier, J., 1996. Le potlatch: une modélisation par les systèmes multi-agents. 
        DEA Espaces Temps, Environnement, Soci&eacute;t&eacute;s, Orléans, Université 
        d'Orléans. 42p.</p>

      <p>&nbsp;</p>

      <table width="100%" border="0">
        <tr> 
          <td width="33%"> <font size="-6" color="#666666">Last update : 14 June 2007</font></td>
        </tr>
      </table>
      <!--#include virtual="/include/copyright_en.inc" --> </TD> 

		  <TD WIDTH="15" VALIGN="top" BGCOLOR="#FFFFFF">&nbsp; </TD> 

  </TR> 

</TABLE> </BODY>

</HTML>