<html>
<head>
<meta name="KeyWords" content="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">
<title> Une sélection de liens</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<!--#include virtual="/include/script.inc" -->
<link rel="stylesheet" href="/css/cormas.css" -->
</head>
<body  marginwidth="0" marginheight="0" topmargin="0" leftmargin="0" border="0" onLoad="MM_preloadImages('/images/fr/accueil_r.gif','/images/fr/demarche_r.gif','/images/fr/logiciel_r.gif','/images/fr/applications_r.gif','/images/fr/biblio_r.gif','/images/fr/formation_r.gif','/images/fr/reseaux_r.gif')" bgcolor="#FFFFFF">
<!--#include virtual="haut.inc" -->
<table cellspacing="0" cellpadding="0" border="0" width="100%">
<tr>
    <!--#include virtual="sommair.inc" --> 
    <td width="*" valign="top" bgcolor="#FFFFFF"> 
    <p>&nbsp;<p>
    <h1>Une s&eacute;lection de liens</h1>
      
      <p>Il existe quelques environnements de programmation d&eacute;di&eacute;s 
        &agrave; la cr&eacute;ation de syst&egrave;mes multi-agents. Nous pouvons 
        les classer en deux cat&eacute;gories: certains d'entre-eux sont ax&eacute;s 
        vers la construction de mod&egrave;les de simulation, d'autres sont orient&eacute;s 
        vers une communication entre syst&egrave;mes distribu&eacute;s.</p>
      <h2>Les agents pour la simulation scientifique</h2>
      <p>On peut distinguer deux grands domaines pour la simulation scientifique. 
        L'un porte sur l'&eacute;tude des mécanismes de coopération, de compétition 
        et d’auto-régulation; Il s'attache &agrave; comprendre les concepts d ’émergence 
        et d’intelligence collective. L'autre domaine est celui de la modélisation 
        et simulation de syst&egrave;mes complexes en agronomie, en écologie, 
        en économie et en sociologie. </p>
      <p>Exemples d'outils : </p>
      <h3>Ascape </h3>
      <p>Ascape est une plate-formel pour d&#233;velopper et analyser des mod&#232;les 
        multi-agents. Dans Ascape, les agents existent dans <i> des scapes </i>( 
        des collections d'agents). Ces scapes sont eux-m&#234;mes des agents, 
        de sorte que des mod&#232;les typiques d'Ascape se composent des &quot; 
        collections de collections &quot; d'agents. Ascapes fournit un contexte 
        pour l'interaction d'agents et les ensembles de r&#232;gles qui r&#233;gissent 
        leurs comportements. Ascape propose des vues des simulation et des graphiques 
        statistiques. Ascape se situe dans la lign&eacute;e de <a href="../applica/sugarScape.htm">SugarScape</a> 
        pour le domaine des &eacute;tudes &eacute;conomiques.</p>
      <p><a href="http://www.brook.edu/ES/dynamics/models/ascape/">http://www.brook.edu/ES/dynamics/models/ascape/</a> 
      </p>
      <h3>M<font size="3">AD</font>K<font size="3">IT</font></h3>
      <p>MadKit est un environnement de programmation en Java d&eacute;di&eacute; 
        &agrave; la cr&eacute;ation de syst&egrave;mes multi-agents. Il est orient&eacute; 
        vers la simulation et la communication entre syst&egrave;mes distribu&eacute;s. 
        MadKit est con&ccedil;u sur un concept d'organisation original bas&eacute; 
        sur les notions d'agents, de groupes et de r&ocirc;les. Sans pr&eacute;supposition 
        sur la structure des agents, MadKit fournit des outils pour la gestion 
        des cycles de vie, l'envoi de messages, la distribution, etc. </p>
      <p><a href="http://www.madkit.org" target="_blank">http://www.madkit.org</a></p>
      <h3>Mobydic</h3>
      <p>Mobidyc est un outil d&eacute;di&eacute; a la construction et &agrave; 
        l'utilisation de mod&egrave;les individu-centr&eacute;s pour la dynamique 
        des communaut&eacute;s. Il s'adresse au biologiste sans exp&eacute;rience 
        de la programmation. Bas&eacute; sur l'id&eacute;e que le comportement 
        d'un agent peut le plus souvent se d&eacute;composer en quelques primitives 
        (des sous-actions) param&eacute;trables, ce projet entend montrer que 
        bien des mod&egrave;les de la litt&eacute;rature (individu-centr&eacute;s 
        et automates cellulaires) peuvent &ecirc;tre &eacute;crits rapidement, 
        &agrave; la souris, sans utiliser une ligne de code. L'id&eacute;e directrice 
        est donc de rendre le biologiste plus maître de son mod&egrave;le pour 
        qu'il puisse laisser s'&eacute;panouir son imagination ! (Vincent Ginot)</p>
      <p><a href="http://www.thonon.inra.fr/mobidyc" target="_blank">http://www.thonon.inra.fr/mobidyc</a> 
      </p>
      <h3>MODULECO </h3>
      <p>MODULECO est un prototype de plate-forme "multi-agent", fondé sur un 
        modèle informatique original, conçu pour simuler les marchés, les phénomènes 
        sociaux et la dynamique des populations.</p>
      <p><a href="http://digemer.enst-bretagne.fr/%7Ephan/moduleco/">http://digemer.enst-bretagne.fr/~phan/moduleco/</a></p>
      <h3>StarLogo </h3>
      <p>StarLogo est une version sp&eacute;cialis&eacute;e du langage de programmation 
        de <i>logo</i>. Avec des versions traditionnelles de logo, vous pouvez 
        cr&eacute;er des sch&eacute;mas et des animations en donnant des commandes 
        aux tortues " graphiques " sur l'&eacute;cran de votre ordinateur. StarLogo 
        &eacute;tend cette id&eacute;e en vous permettant de contr&ocirc;ler des 
        milliers de tortues graphiques en parall&egrave;le.</p>
      <p>StarLogo est un environnement mod&eacute;lisation programmable pour explorer 
        les fonctionnements des syst&egrave;mes d&eacute;centralis&eacute;s (des 
        syst&egrave;mes qui sont organis&eacute;s sans organisateur, coordonn&eacute;s 
        sans coordonnateur !). StarLogo permet de mod&eacute;liser beaucoup de 
        ph&eacute;nom&egrave;nes r&eacute;els, tels que des bands de poissons, 
        des embouteillages, des colonies de fourmi, et des march&eacute;s &eacute;conomiques. 
      </p>
      <p><a href="http://www.media.mit.edu/starlogo/">http://www.media.mit.edu/starlogo/</a> 
      </p>
      <h3>Swarm</h3>
      <p>Swarm est un progiciel pour la simulation multi-agent des syst&egrave;mes 
        complexes, initialement d&eacute;velopp&eacute;e au Santa-F&eacute; Institute. 
        Swarm est destin&eacute; &agrave; la recherche dans une vari&eacute;t&eacute; 
        de disciplines. L'architecture de base de Swarm est la simulation des 
        collections d'agents agissants l'un sur l'autre concurremment: &quot;avec 
        cette architecture, nous pouvons mettre en application une grande vari&eacute;t&eacute; 
        de mod&egrave;les d'agents&quot;.</p>
      <p><a href="http://www.swarm.org" target="_blank">http://www.swarm.org</a></p>
      <h2>Les agents mobiles et assistants </h2>
      <p>Du fait des retomb&eacute;es &eacute;conomiques, cette cat&eacute;gorie 
        d'agents est en grande partie attach&eacute;e au domaine commercial. Ils 
        permettent soit une assistance &agrave; l'utilisateur (gestionnaire d'agendas, 
        filtrage d'e-mail, mémoire de l'utilisateur, ...), soit la recherche adaptative 
        d'informations (indexation de documents, requête BD, recherche coopérative), 
        soit l'activité commerciale (E-commerce, entreprise virtuelle, veille 
        technologique ventes aux enchères, ...) .</p>
      <p>Quelques exemples : </p>
      <p>The <a href="http://agents.www.media.mit.edu/groups/agents">Software 
        Agents group</a> of the MIT Media Lab d&eacute;veloppe plusieurs projets 
        tels que <i>NewT</i> (personnalisation des news), <i>Amalthaea</i> (pour 
        la recherche, le contrôle, et le filtrage des sources d'informations). 
        <i>Letizia</i> (assistant pour la recherche sur le WEB). <i>Yenta</i> 
        (genre de page jaune où les utilisateurs peuvent faire connaissance et 
        communiquer tout en gardant leurs informations personnelles protégées), 
        etc. </p>
      <p><a href="http://www.research.microsoft.com/research/ui/persona/home.htm">Microsoft 
        Persona Project</a>: Un assistant conversationnel qui interagit avec l'utilisateur 
        en langage naturel. Un prototype initial le perroquet <i>Peed</i> a été 
        réalisé pour répondre aux requêtes des usagers dans le domaine musical. 
      </p>
      <p><a href="http://www.ac.com:80/services/cstar/cstr_thought.html">Andersen 
        Consulting</a>: <i>LifestyleFinder</i>, <i>InfoFinder</i> (des agents 
        qui apprennent les préférences des usagers et leur offrent des informations 
        en se basant sur leur mode de vie) <i>BargainFinder</i> (propose une comparaison 
        en temps réel entre les prix des marchandises offertes sur différents 
        sites) </p>
      <p><a href="http://www.trl.ibm.com/aglets/"><i>Aglets</i></a> (IBM), <a href="http://www.genmagic.com/"><i>Odyssey</i></a> 
        (General Magic), ...</p>
      <h2>Pour plus d'informations</h2>
      <p>Pour obtenir des informations plus exhaustives sur les diff&eacute;rentes 
        cat&eacute;gories d'agents, vous pouvez consulter les sites anglophones 
        suivants : <a href="http://citeseer.nj.nec.com/128549.html">Alan Wexelblat 
        and Pattie Maes</a>, <a href="http://agents.umbc.edu/">UMBC Agentsweb</a>, 
        <a href="http://www.multiagent.com/">multiagent.com</a> ou <a href="http://www.agent.org/">Agent 
        Society Home Page</a>, ou encore le site de <a href="http://www.red3d.com/cwr/ibm.html">Reynolds</a>. 
      </p>
      <p>&nbsp;</p>
      <h2>&nbsp;</h2>
      <!--#include virtual="/include/copyright_fr.inc" -->
	</td>
    <td width="15" valign="top" bgcolor="#FFFFFF"> 
    <div align="right" class="texte"></div>
    </td>
  </tr>
</table>
</body>
</html>
