<html>
<head>
<meta name="KeyWords" content="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">
<title>Chasse au Cameroun</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<!--#include virtual="/include/script.inc" -->
<link rel="stylesheet" href="/css/cormas.css" -->
</head>
<body marginwidth="0" marginheight="0" topmargin="0" leftmargin="0" border="0" onLoad="MM_preloadImages('/images/fr/accueil_r.gif','/images/fr/demarche_r.gif','/images/fr/logiciel_r.gif','/images/fr/applications_r.gif','/images/fr/biblio_r.gif','/images/fr/formation_r.gif','/images/fr/reseaux_r.gif')" bgcolor="#FFFFFF">
<!--#include virtual="haut.inc" -->
<table cellspacing="0" cellpadding="0" border="0" width="100%">
<tr>
  <!--#include virtual="sommair.inc" --> 
    <td width="*" valign="top" bgcolor="#FFFFFF"> 
      <p>&nbsp; 
      <h1>Djemiong</h1>
      <h2>Chasse au Cameroun</h2>
      <p>Christophe Le Page, Fran&ccedil;ois Bousquet (Cirad), Innoccent Bakam 
        (Universit&eacute; de Yaounde)</p>
      <p><img src="/images/applica/djemiong.gif" width="212" height="234" align="right" vspace="10" hspace="10" alt="Grille spatiale du mod&egrave;le Djemiong">Ce 
        mod&egrave;le est bas&eacute; sur une &eacute;tude de terrain portant 
        sur la chasse dans les for&ecirc;ts de l'Est du Cameroun, autour d'un 
        village nomm&eacute; Djemiong. Cette &eacute;tude vise &agrave; comprendre 
        comment l'organisation de l'activit&eacute; de chasse entre les villageois 
        constitue un syst&egrave;me de gestion de la ressource. L'esp&egrave;ce 
        principalement captur&eacute;e est une petite antilope, le c&eacute;phalophe 
        bleu (Cephalophus monticola, Thunberg). Des enqu&ecirc;tes ont &eacute;t&eacute; 
        r&eacute;alis&eacute;es afin de comprendre le comportement des chasseurs. 
        L'activit&eacute; de chasse se d&eacute;roule pendant les 6 mois de l'ann&eacute;e 
        au cours desquels l'agriculture (activit&eacute; principale) demande moins 
        de temps. Chaque ann&eacute;e, chaque chasseur change la localisation 
        de ses sentiers de pi&egrave;ges. Ce comportement est pr&eacute;sent&eacute; 
        comme une mesure de gestion de la ressource par les chasseurs.</p>
      <p>Le mod&egrave;le d&eacute;velopp&eacute; avec Cormas est utilis&eacute; 
        pour comparer diff&eacute;rentes r&egrave;gles de positionnement des sentiers 
        de pi&egrave;ges dans le temps et dans l'espace. La partie &quot;dynamique 
        des populations&quot; est un mod&egrave;le individus-centr&eacute;. L'agent 
        c&eacute;phalophe a &eacute;t&eacute; d&eacute;fini &agrave; partir des 
        valeurs, trouv&eacute;es dans la litt&eacute;rature, des param&egrave;tres 
        biologiques et &eacute;thologiques qui caract&eacute;risent cet animal. 
        Les r&egrave;gles comportementales des agents chasseurs ont pu &ecirc;tre 
        mises en &eacute;vidence &agrave; partir des enqu&ecirc;tes de terrain. 
        Le mod&egrave;le int&egrave;gre des donn&eacute;es provenant d'un syst&egrave;me 
        d'information g&eacute;ographique (SIG). La grille spatiale repr&eacute;sente 
        ainsi un paysage artificiel dont les contours sont ceux du territoire 
        du village de Djemiong. Les r&eacute;sultats soulignent l'importance des 
        processus de coordination entre les chasseurs, en partie en raison de 
        l'appropriation de r&eacute;seaux de sentiers de pi&egrave;ges par des 
        groupes familiaux. Les r&eacute;sultats des simulations sugg&egrave;rent 
        que la localisation spatiale des pi&egrave;ges a un impact beaucoup plus 
        fort sur la viabilit&eacute; de la population de c&eacute;phalophes que 
        la pression de chasse globale ou la dur&eacute;e de la p&eacute;riode 
        non chass&eacute;e. </p>
      <ul>
        <li>T&eacute;l&eacute;charger le mod&egrave;le Cormas (<a href="/logiciel/Djemiong.zip">archive 
          zip</a>, 13Ko).</li>
        <li>T&eacute;l&eacute;charger un article &agrave; propos de ce mod&egrave;le: 
          <ul>
            <li>Bousquet, F., Le Page, C., Bakam, I. et Takforyan, A., 2001. A 
              spatially explicit individual-based model of blue duikers population 
              dynamics: multi-agent simulation of bushmeat hunting in an eastern 
              cameroonian village. Ecological Modelling, 138(1-3): 331-346. <a href="/pdf/djemiong.pdf" target="_blank"><img src="/images/renvoi.gif" width="16" height="15" border="0"></a></li>
          </ul>
        </li>
        <li>Pour plus d'information, <a href="mailto:lepage@cirad.fr">contacter 
          les auteurs</a>.</li>
      </ul>
      <!--#include virtual="/include/copyright_fr.inc" --> </td>
  <td width="15" valign="top" bgcolor="#FFFFFF"> 
   <div align="right" class="texte"></div>
  </td>
 </tr>
</table>
</body>
</html>
