<html>
<head>
<meta name="KeyWords" content="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">
<title>Echos</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<!--#include virtual="/include/script.inc" -->
<link rel="stylesheet" href="/css/cormas.css" -->
</head>
<body marginwidth="0" marginheight="0" topmargin="0" leftmargin="0" border="0" onLoad="MM_preloadImages('/images/fr/accueil_r.gif','/images/fr/demarche_r.gif','/images/fr/logiciel_r.gif','/images/fr/applications_r.gif','/images/fr/biblio_r.gif','/images/fr/formation_r.gif','/images/fr/reseaux_r.gif')" bgcolor="#FFFFFF">
<!--#include virtual="/fr/applica/haut.inc" --> 
<table cellspacing="0" cellpadding="0" border="0" width="100%">
  <tr> <!--#include virtual="/fr/applica/sommair.inc" --> 
    <td width="*" valign="top" bgcolor="#FFFFFF"> 
      <p>&nbsp; 
      <h1>Echos</h1>
      <h2>Analyse du comportement économique des acteurs de la fili&egrave;re 
        &quot;effluents d'&eacute;levage&quot; &agrave; La R&eacute;union</h2>
      <p>Stefano Farolfi, Pierre Bommel, Christophe Le Page (Cirad)</p>
      <p><img src="/images/applica/magmas1.jpg" width="240" height="162" align="right">Certaines 
        communes des hauteurs de l'&icirc;le de la Réunion pr&eacute;sentent une 
        forte densit&eacute; d'élevages porcins. Les problèmes de pollution provoquée 
        par ce type d'élevage sont abordés par l'institution publique qui doit 
        choisir un ensemble de mesures environnementales adapté au cas local. 
        Dans un souci de respect de l'environnement, des règles ont été établies 
        pour l'épandage de ces effluents d'élevage. Dans un contexte normatif 
        fort dynamique et toujours plus contraignant, les éleveurs se trouvent 
        confrontés à un système de normes et, peut-être bientôt, d'instruments 
        économiques (taxes, subventions) qui induisent de nouveaux choix de gestion 
        de leurs effluents. Nous avons choisi d'étudier le comportement économique 
        des éleveurs de Grand-Ilet, zone dans laquelle les surfaces épandables 
        sont insuffisantes. Dans le m&ecirc;me secteur de l'&icirc;le, la zone 
        c&ocirc;ti&egrave;re (St-Andr&eacute;) est domin&eacute;e par des exploitations 
        de canne à sucre qui ont des besoins de mati&egrave;re organique importants. 
      </p>
      <p>L'objectif du mod&egrave;le est de simuler plusieurs scenarios de gestion 
        des effluents d'&eacute;levage &agrave; Grand-Ilet selon diff&eacute;rentes 
        orientations de politique environnementale, et ceci pour tester dans quelle 
        mesure l'application des instruments &eacute;conomiques et r&eacute;glementaires 
        mentionn&eacute;s ci-dessus peut modifier le comportement des &eacute;leveurs. 
      </p>
      <p>Dans le cas particulier de cette &eacute;tude, deux alternatives de gestion 
        des effluents sont compar&eacute;es:</p>
      <ul>
        <li>strat&eacute;gie 1: &eacute;pandage syst&eacute;matique des effluents 
          sur les parcelles de l'exploitation d'&eacute;levage,</li>
        <li>strat&eacute;gie 2: transport des ex&eacute;dents d'effluents vers 
          les exploitations canni&egrave;res de la zone c&ocirc;ti&egrave;re.</li>
      </ul>
      <p>Selon un calcul prévisionnel du coût rélatif aux deux stratégies, l'éleveur 
        choisit chaque année d'adopter l'année suivante l'une des stratégies 1 
        ou 2. Le mod&egrave;le permet ainsi de simuler les comportements des producteurs-pollueurs, 
        donnant lieu &agrave; des sc&eacute;narios qui illustrent les dynamques 
        &eacute;conomiques (co&ucirc;ts individuels et co&ucirc;ts sociaux) et 
        &eacute;cologiques (pollution azot&eacute;e).</p>
      <p>Les quatre sc&eacute;narios que nous avons test&eacute;s sont bas&eacute;s 
        sur une modulation des instruments de politique environnementale et sur 
        diff&eacute;rentes disponibilit&eacute;s de surface canni&egrave;re &eacute;pandable 
        :</p>
      <ol>
        <li>Norme = 170 Kg.N / Ha; redevance pollution = 0; surface exploitation 
          canni&egrave;re comprise entre 20 et 40 Ha</li>
        <li>Norme = 170 Kg.N / Ha; redevance pollution progressive (tous les deux 
          ans, + 2 FF pour chaque Kg.N ex&eacute;dentaire); surface exploitation 
          canni&egrave;re comprise entre 20 et 40 Ha</li>
        <li>Idem 2, surface exploitation canni&egrave;re comprise entre 40 et 
          80 Ha</li>
        <li>Idem 2, Norme = 300 Kg.N / Ha</li>
      </ol>
      <table width="75%" border="1" bordercolorlight="#FFFFFF" bordercolordark="#FFFFFF" align="center">
        <tr> 
          <td> 
            <div align="center"><img src="/images/applica/echos1.gif" width="114" height="85"></div>
          </td>
          <td> 
            <div align="center"></div>
          </td>
          <td> 
            <div align="center"><img src="/images/applica/echos2.gif" width="115" height="86"></div>
          </td>
          <td> 
            <div align="center"></div>
          </td>
          <td> 
            <div align="center"><img src="/images/applica/echos3.gif" width="114" height="86"></div>
          </td>
          <td> 
            <div align="center"></div>
          </td>
          <td> 
            <div align="center"><img src="/images/applica/echos4.gif" width="115" height="86"></div>
          </td>
        </tr>
        <tr> 
          <td> 
            <div align="center">Sc&eacute;nario 1</div>
          </td>
          <td> 
            <div align="center"></div>
          </td>
          <td> 
            <div align="center">Sc&eacute;nario 2</div>
          </td>
          <td> 
            <div align="center"></div>
          </td>
          <td> 
            <div align="center">Sc&eacute;nario 3</div>
          </td>
          <td> 
            <div align="center"></div>
          </td>
          <td> 
            <div align="center">Sc&eacute;nario 4</div>
          </td>
        </tr>
      </table>
      <p>Les figures ci-dessus repr&eacute;sentent les &eacute;tats finaux de 
        l'environnement simul&eacute; apr&egrave;s 10 ans. La partie gauche de 
        la carte repr&eacute;sente les &eacute;levages de la localit&eacute; de 
        Grand-Ilet, la partie droite repr&eacute;sente les cultures de canne-&agrave;-sucre 
        de la zone littorale.</p>
      <p>&nbsp;</p>
      <p>Pour plus d'information, <a href="mailto:stefano.farolfu@cirad.fr">contacter 
        l'auteur</a>.</p>
      <h2>References</h2>
      <p>Farolfi, S., Le Page, C., Tidball, M. et Bommel, P. (2001). Gestion des 
        effluents d'&eacute;levage &agrave; l'&icirc;le de La R&eacute;union: 
        analyse du comportement &eacute;conomique des acteurs selon une approche 
        standard et par un syst&egrave;me multi-agent. S&eacute;minaire de recherche 
        &quot;Pr&eacute;servation et valorisation de l'eau dans le domaine littoral&quot;, 
        St-Denis de la R&eacute;union, 15 juin 2001.</p>
      <p><a href="http://www.cirad.fr/presentation/programmes/espace/effluent/effluent.shtml">http://www.cirad.fr/presentation/programmes/espace/effluent/effluent.shtml</a> 
      </p>
      <!--#include virtual="/include/copyright_fr.inc" --> </td>
    <td width="15" valign="top" bgcolor="#FFFFFF"> 
      <div align="right" class="texte"></div>
    </td>
  </tr>
</table>
</body>
</html>
