<html>
<head>
<meta name="KeyWords" content="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">
<title> Sylvopast et Mejan, negociations autour de plans de gestion</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<!--#include virtual="/include/script.inc" -->
<link rel="stylesheet" href="/css/cormas.css" -->
</head>
<body marginwidth="0" marginheight="0" topmargin="0" leftmargin="0" border="0" onLoad="MM_preloadImages('/images/fr/accueil_r.gif','/images/fr/demarche_r.gif','/images/fr/logiciel_r.gif','/images/fr/applications_r.gif','/images/fr/biblio_r.gif','/images/fr/formation_r.gif','/images/fr/reseaux_r.gif')" bgcolor="#FFFFFF">
<!--#include virtual="haut.inc" -->
<table cellspacing="0" cellpadding="0" border="0" width="100%">
<tr>
  <!--#include virtual="sommair.inc" --> 
  <td width="*" valign="top" bgcolor="#FFFFFF"> 
   <p>&nbsp;
   
      <h1>Sylvopast et Mejan (jeux de r&ocirc;le)</h1>
      <h2>N&eacute;gociations autour de plans de gestion</h2>
      <p>Michel Etienne, Inra</p>
 
      <p>Les mod&egrave;les Sylvopast et Mejan (d&eacute;crits dans une <a href="etiennemodeles.htm">autre 
        page</a>) peuvent &ecirc;tre utilis&eacute;s comme jeux de r&ocirc;le. 
        Ils simulent des n&eacute;gociations sur l'&eacute;tablissement de plans 
        de gestion d'&eacute;cosyt&egrave;mes. Dans les deux mod&egrave;les, les 
        acteurs ont des strat&eacute;gies contrast&eacute;es. L'objet de la n&eacute;gociation 
        est la mise en oeuvre d'un plan de gestion pour pr&eacute;venir les feux 
        dans les for&ecirc;ts m&eacute;diterran&eacute;ennes (Sylvopast) ou pour 
        limiter le d&eacute;veloppement du pin dans des &eacute;cosyst&egrave;mes 
        &agrave; forte biodiversit&eacute; (Mejan).</p>
      <h2>Sylvopast</h2>
      <p>Dans Sylvopast, le syst&egrave;me multi-agent est coupl&eacute; &agrave; 
        un jeu de rôle. Ce dernier est d&eacute;velopp&eacute; sous Excel et Visual 
        Basic pour m&eacute;moriser le d&eacute;roulement de la partie. Le jeu 
        fonctionne de la m&ecirc;me fa&ccedil;on que le mod&egrave;le mais il 
        permet de faire apparaître oralement les strat&eacute;gies de n&eacute;gociations 
        et de comprendre les d&eacute;cisions des agents (bergers ou forestiers).</p>
   <p>Quand de vrais gestionnaires jouent, il est int&eacute;ressant d'inverser les 
    rôles pour que chacun comprennent les n&eacute;cessit&eacute;s et les difficult&eacute;s de 
    l'autre. Des techniciens peuvent utiliser le jeu pour tester ses capacit&eacute;s 
    et comparer ses choix &agrave; ceux d'autres coll&egrave;gues. Le jeu peut permettre 
    &agrave; chacun de d&eacute;velopper ses connaissances sur la gestion des ressources 
    naturelles.</p>
   <h2>Mejan</h2>
      <p>Le syst&egrave;me multi-agents simule les dynamiques du paysage en fonction 
        d'&eacute;volutions socio-&eacute;conomiques probables et &eacute;value 
        les effets des strat&eacute;gies de conservation de la nature. Un jeu 
        de rôle va &ecirc;tre d&eacute;velopp&eacute; avec Cormas pour aider les 
        agents pour pr&eacute;voir l'impact du pin et pour simuler des n&eacute;gociations 
        entre les acteurs (bergers, forestiers, parc national).</p>
   <p>Pour en savoir plus, <a href="mailto:etienne@avignon.inra.fr">contactez 
    l'auteur</a>.</p>
   <!--#include virtual="/include/copyright_fr.inc" -->
	</td>
  <td width="15" valign="top" bgcolor="#FFFFFF"> 
   <div align="right" class="texte"></div>
  </td>
 </tr>
</table>
</body>
</html>
