<html>

<head>

<meta name="KeyWords" content="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">

<title>FloAgri</title>

<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">



<!--#include virtual="/include/script.inc" -->

<link rel="stylesheet" href="/css/cormas.css" -->

</head>

<body marginwidth="0" marginheight="0" topmargin="0" leftmargin="0" border="0" onLoad="MM_preloadImages('/images/fr/accueil_r.gif','/images/fr/demarche_r.gif','/images/fr/logiciel_r.gif','/images/fr/applications_r.gif','/images/fr/biblio_r.gif','/images/fr/formation_r.gif','/images/fr/reseaux_r.gif')" bgcolor="#FFFFFF">

<!--#include virtual="haut.inc" -->

<table cellspacing="0" cellpadding="0" border="0" width="100%">

<tr>

  <!--#include virtual="sommair.inc" --> 

  <td width="*" valign="top" bgcolor="#FFFFFF"> 

   <p>&nbsp;

   

      <h1>FloAgri.</h1>
      <h2>De nouvelles opportunit&eacute;s technologiques pour les petits agriculteurs d'Amazonie de renforcer leur r&eacute;sistence aux risques tout en pr&eacute;servant la for&ecirc;t. </h2>
      <h2>Exp&eacute;riences de terrain crois&eacute;es avec la mod&eacute;lisation multi-agent. </h2>
<p><strong>Bommel, P., Sist, P., Piketty, M-G., Bendahan,  A. B. </strong>      </p>
<p>En cherchant des alternatives techniques &agrave; l'utilisation conventionnelle des terres en Amazonie, le projet Floagri (financ&eacute; par l'UE) a exp&eacute;riment&eacute; plusieurs pratiques sur le terrain avec les petits agriculteurs afin de parvenir &agrave; un d&eacute;veloppement plus durable. Nous avons analys&eacute; les avantages et les contraintes de ces exp&eacute;riences sur le terrain. Deux d'entre eux ont &eacute;t&eacute; formalis&eacute;s dans un mod&egrave;le multi-agent :   les plantations permanentes de  cultures annuelles (PPCA) et la gestion des for&ecirc;ts (GF) de la &quot;r&eacute;serve l&eacute;gale&quot; de la propri&eacute;t&eacute; (80%) des petits agriculteurs. Bas&eacute; sur les techniques d'agriculture de conservation (semis direct sous couvert v&eacute;g&eacute;tal, SCV), la PPCA vise &agrave; r&eacute;cup&eacute;rer les p&acirc;turages d&eacute;grad&eacute;s afin d'&eacute;viter la culture sur br&ucirc;lis. La GF consiste &agrave; utiliser la &quot;r&eacute;serve l&eacute;gale&quot; (80% de la superface de l'exploitation) sans couper la for&ecirc;t.</p>
      <table width="851" border="0">
        <tr>
          <td width="250" height="377" valign="top"><p>Notre mod&egrave;le vise &agrave; &eacute;valuer les performances &eacute;conomiques et les impacts environnementaux des &eacute;leveurs  et de tester l'influence de la PPCA et la gestion  foresti&egrave;re en tant qu'activit&eacute;s suppl&eacute;mentaires. Le principe de cette analyse consiste alors &agrave; comparer les diverses activit&eacute;s de production &agrave; partir des m&ecirc;mes conditions initiales. Consid&eacute;rant que l'agriculture familiale en Amazonie est principalement orient&eacute;e vers l'&eacute;levage, chaque agent adopte une strat&eacute;gie &eacute;leveur et un ensemble d'activit&eacute;s sp&eacute;cifiques. Pour toutes les simulations, les agents d&eacute;butent avec une ferme identique contenant la m&ecirc;me r&eacute;partition de la couverture v&eacute;g&eacute;tale et m&ecirc;me la qualit&eacute; de sol. La main d'oeuvre active de chaque agent est &eacute;galement strictement identique.</p></td>
          <td width="591"><img src="../../images/applica/floagri1.jpg" alt="Floagri: Alternativas Adaptadas" width="509" height="375" hspace="33"></td>
        </tr>
      </table>
      <p>&nbsp;</p>
      <table width="854" border="0">
        <tr>
          <td width="474"><img src="../../images/applica/floagri2.jpg" alt="Ro&ccedil;a permanente" width="460" height="361"></td>
          <td width="370">Notre &eacute;tude ne compare pas uniquement les b&eacute;n&eacute;fices financiers des activit&eacute;s agricoles mises en &oelig;uvre dans le projet. Mais il cherche aussi &agrave; mieux comprendre et &agrave; &eacute;valuer la faisabilit&eacute; de chaque nouvelle activit&eacute; en termes de gestion de la main d'oeuvre familiale, la disponibilit&eacute; en terres fertiles et la rentabilit&eacute; &eacute;conomique.<br>
Nos premiers r&eacute;sultats montrent que la stricte conformit&eacute; &agrave; la l&eacute;gislation (ne pas d&eacute;boiser 80% de la propri&eacute;t&eacute;) n'est pas viable &eacute;conomiquement  si les agents appliquent les fa&ccedil;ons de faire conventionnelles. Or, en regardant les donn&eacute;es sur papier, les nouvelles activit&eacute;s du projet ne fournissent pas d'avantages &eacute;vidents par rapport &agrave; l'&eacute;levage  traditionnels. Mais les simulations montrent que lorsque l'on prend en compte le risque (comme la probabilit&eacute; d'&ecirc;tre malade), les activit&eacute;s suppl&eacute;mentaires de FloAgri peuvent am&eacute;lior&eacute;es les revenus  en permettant aux agents de surmonter leurs difficult&eacute;s passag&egrave;res tout en pr&eacute;servant leur for&ecirc;t.<br>
Ainsi, les exp&eacute;rimentations en grandeur r&eacute;elle de FloAgri, combin&eacute;es avec l'analyse par simulation, r&eacute;v&egrave;lent que de nouvelles pratiques agricoles peuvent accro&icirc;tre les capacit&eacute;s des petits agriculteurs de r&eacute;sister  aux dangers. Dans le m&ecirc;me temps, en pr&eacute;servant leur for&ecirc;t, ils contribuent au d&eacute;veloppement durable de la r&eacute;gion amazonienne.</td>
        </tr>
      </table>
      <h3 align="left">Description d&eacute;taill&eacute;es du <a href="../../en/applica/floagriDescription.htm">mod&egrave;le</a> et principaux <a href="../../en/applica/floagriResults.htm"> r&eacute;sultats</a> (en anglais).</h3>
      <h2 align="left">References </h2>
      <p>Pour plus d'information, <a href="mailto:bommel@cirad.fr">contacter les 
        auteurs.</a></p>
      <p>Article d'actualit&eacute; du Cirad : <a href="http://www.cirad.fr/actualites/toutes-les-actualites/articles/2010/science/floagri">Quand l&rsquo;agriculture familiale pr&eacute;serve la for&ecirc;t amazonienne</a></p>
      <p><a href="http://www.cirad.fr/ur/green/themes_et_projets_de_recherche/projets_finis/floagri">Pr&eacute;sentation de Floagri</a> sur le site de l'UR Green.</p>

      <!--#include virtual="/include/copyright_fr.inc" -->

	</td>

  <td width="15" valign="top" bgcolor="#FFFFFF"> 

   <div align="right" class="texte"></div>

  </td>

 </tr>

</table>

</body>

</html>

