<html>

<head>

<title>Nong Chok</title>

<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">



<!--#include virtual="/include/script.inc" -->

<link rel="stylesheet" href="/css/cormas.css" -->

</head>

<body marginwidth="0" marginheight="0" topmargin="0" leftmargin="0" border="0" onLoad="MM_preloadImages('/images/fr/accueil_r.gif','/images/fr/demarche_r.gif','/images/fr/logiciel_r.gif','/images/fr/applications_r.gif','/images/fr/biblio_r.gif','/images/fr/formation_r.gif','/images/fr/reseaux_r.gif')" bgcolor="#FFFFFF">

<!--#include virtual="haut.inc" -->

<table cellspacing="0" cellpadding="0" border="0" width="100%">

<tr>

  <!--#include virtual="sommair.inc" -->

    <td width="*" valign="top" bgcolor="#FFFFFF"> 

      <p>&nbsp; 

      <h1>Nong Chok</h1>

      <h2>DYNAMIQUES DES CHANGEMENTS D'UTILISATION DES TERRES EN MILIEU PERI-URBAIN 

        A BANGKOK</h2>

      <p>Sk. Morshed Anwar ( Asian Institute of Technology, Bangkok, Thailand)</p>

      <p><img src="../../images/applica/animNongChok.gif" width="296" height="341" align="left"></p>

      <p>&nbsp;</p>

      <p>Il est important d'&eacute;tudier les forces en jeu qui contribuent aux 

        changements d'utilisation des terres pour en comprendre les processus 

        et les dynamiques. Les mod&egrave;les de simulation qui prennent explicitement 

        l'espace en compte permettent d'&eacute;valuer des hypoth&egrave;ses d'&eacute;volution 

        de paysage sous plusieurs sc&eacute;narios. Notre recherche propose un 

        mod&egrave;le dynamique de simulation de changement d'utilisation de la 

        terre de la r&eacute;gion de Nong Chok (Tha&iuml;lande centrale). Ces 

        simulations ont &eacute;t&eacute; effectu&eacute;es en int&eacute;grant 

        des donn&eacute;es issues de t&eacute;l&eacute;d&eacute;tection, de syst&egrave;mes 

        d'information g&eacute;ographiques (SIG) dans Cormas.</p>

      <p align="left">&nbsp;</p>

      <p align="left">&nbsp;</p>

      <p align="left">&nbsp;</p>

      <p align="left">La m&eacute;thodologie de notre travail repose sur trois 

        phases :</p>

      <ul>

        <li>Analyse des changements d'utilisation des terres,</li>

        <li>d&eacute;veloppement et impl&eacute;mentation d'un mod&egrave;le, 

          et </li>

        <li>validation de ce mod&egrave;le. </li>

      </ul>

      <h2 align="left">Le mod&egrave;le</h2>

      <p align="left"><img src="../../images/applica/NongChokInterface.jpg" width="265" height="319" align="right">L'architecture 

        du mod&egrave;le repose sur un automate cellulaire et sur des fonctions 

        de transition qui simulent les dynamiques de changement d'utilisation 

        de la terre, en int&eacute;grant des processus biophysiques et humains. 

      </p>

      <p align="left">Notre &eacute;tudes a &eacute;t&eacute; con&ccedil;ue pour 

        simuler les dynamiques de changements d'utilisation des terres, en particulier 

        des rizi&egrave;res &agrave; l'aquaculture.</p>

      <p align="left">Le mod&egrave;le a &eacute;t&eacute; con&ccedil;u sur la 

        base de 19 ann&eacute;es de donn&eacute;es (de 1981 &agrave; 2000). Ces 

        donn&eacute;es qui d&eacute;crivent l'historique des sh&eacute;mas spatiaux 

        d'utilisation des terres proviennent de photographies a&eacute;riennes 

        de cette p&eacute;riodes. </p>

      <p align="left">Les fonctions de transitions ont &eacute;t&eacute; d&eacute;velopp&eacute;es 

        selon un calcul d'enthropie en utilisant l'algorithme ID3. La configuration 

        initiale de l'espace est bas&eacute;e sur une carte d'utilisation des 

        terres de 1981. Les autres entr&eacute;es du mod&egrave;les sont les variables 

        spatiales et humaines : distance au canal, age, propri&eacute;taires, 

        religion, &eacute;ducation, et taille de la famille des fermiers. A part 

        quelques exceptions, les r&eacute;sultats des simulations montrent la 

        performance du mod&egrave;le pour la diffusion de l'aquaculture.</p>

      <p align="left"><img src="../../images/applica/NongChokResult.jpg" width="286" height="280"></p>

      <p align="left">&nbsp;</p>

      <h2 align="left"><img src="../../images/applica/NongchokFractal.jpg" width="479" height="412" align="right">Description 

        du mod&egrave;le</h2>

      <p align="left">Pour valider ce mod&egrave;le de simulation des dynamiques 

        de changements d'occupation de l'espace, les cartes simul&eacute;es ont 

        &eacute;t&eacute; compared avec la carte originale d'utilisation de l'espace 

        de 2000. en utilisant un ensemble d'indices paysagers : nombre de cellules 

        en aquaculture, densit&eacute; des parcelles, taille moyenne des parcelles, 

        densit&eacute; des fronts, dimension fractale et nombre moyen des voisins 

        aux contacts. D'autres &eacute;tudes pourrait permettre de simuler le 

        changement d'utilisation de la terre avec plus d'exactitude, en int&eacute;grant 

        d'autres variables.</p>

      <p align="left">&nbsp;</p>

      <p align="left">&nbsp;</p>

      <h2 align="left">R&eacute;f&eacute;rences</h2>

      <p align="left">SK, Morshed Anwar, LAND USE CHANGE DYNAMICS: A DYNAMIC SPATIAL 

        SIMULATION, AIT master dissertation, School of Advanced Technologies, 

        Bangkok, November 2002</p>

      <p>Pour en savoir plus, <a href="/pdf/Thesis_Morshed.pdf">t&eacute;l&eacute;chargez 
        le m&eacute;moire</a>, ou contactez l'auteur <a href="mailto:iamhiraj@yahoo.com">Sk 
        Morshed Anwar</a></p>

      <!--#include virtual="/include/copyright_fr.inc" -->

    </td>

  <td width="15" valign="top" bgcolor="#FFFFFF"> 

   <div align="right" class="texte"></div>

  </td>

 </tr>

</table>

</body>

</html>

