<html>
<head>
<meta name="KeyWords" content="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">
<title> Organisation et coordination sur des périmètres</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<!--#include virtual="/include/script.inc" -->
<link rel="stylesheet" href="/css/cormas.css" -->
</head>
<body marginwidth="0" marginheight="0" topmargin="0" leftmargin="0" border="0" onLoad="MM_preloadImages('/images/fr/accueil_r.gif','/images/fr/demarche_r.gif','/images/fr/logiciel_r.gif','/images/fr/applications_r.gif','/images/fr/biblio_r.gif','/images/fr/formation_r.gif','/images/fr/reseaux_r.gif')" bgcolor="#FFFFFF">
<!--#include virtual="haut.inc" -->
<table cellspacing="0" cellpadding="0" border="0" width="100%">
<tr>
  <!--#include virtual="sommair.inc" --> 
  <td width="*" valign="top" bgcolor="#FFFFFF"> 
   <p>&nbsp;
   
      <h1>Shadoc </h1>
      <h2>Organisation et coordination sur des p&eacute;rim&egrave;tres 
       irrigu&eacute;s</h2>
      <p>Olivier Barreteau, Cemagref.</p>
      <img src="/images/applica/shadoc1.jpg" width="255" height="174" align="right" vspace="10" hspace="10" alt="Jeu de r&ocirc;le avec Shadoc"> 
      <p>Ce syst&egrave;me multi-agent a d'abord &eacute;t&eacute; construit dans une perspective de 
    recherche. Il s'agissait d'explorer les liens entre les modes de coordination 
    entre paysans dans un syst&egrave;me irrigu&eacute; de la moyenne vall&eacute;e du Fleuve S&eacute;n&eacute;gal 
    et la viabilit&eacute; du syst&egrave;me. Le mod&egrave;le constitue ici un syst&egrave;me irrigu&eacute; 
    virtuel &agrave; vocation de support d'exp&eacute;rimentation afin d'&eacute;viter la pratique 
    du " learning by doing ".</p>
   <p>Il repose sur la repr&eacute;sentation d'un arch&eacute;type de syst&egrave;me irrigu&eacute; de 
    la moyenne vall&eacute;e du S&eacute;n&eacute;gal ainsi que sur la repr&eacute;sentation d'un ensemble 
    de paysans structur&eacute; en plusieurs groupements, en charges d'activit&eacute;s 
    sp&eacute;cifiques tels que l'allocation de l'eau, l'acc&egrave;s au cr&eacute;dit ou la gestion 
    du r&eacute;seau principal et de la station de pompage. Les paysans sont d&eacute;crits 
    en particulier par un lien vers une parcelle et un objectif de mise en 
    valeur de cette parcelle (voir figure 1). Les r&egrave;gles mises en œuvre par 
    les agents concernent successivement au cours d'une campagne : l'acc&egrave;s 
    et la r&eacute;partition du cr&eacute;dit, puis de l'eau et l'&eacute;valuation du d&eacute;roulement 
    de la campagne et des r&egrave;gles qui y sont men&eacute;es. La simulation permet d'enchaîner 
    plusieurs campagnes.</p>
   <p align="center"><img src="/images/applica/shadoc3.gif" width="259" height="202"></p>
   <p align="center">Figure 1. L'interface graphique du mod&egrave;le</p>
   <p>Les simulations permettent d'observer la long&eacute;vit&eacute; du syst&egrave;me irrigu&eacute; 
    ainsi constitu&eacute; sans intervention ext&eacute;rieure en tenant compte du taux 
    d'utilisation. Les sc&eacute;narios simul&eacute;s comportent des param&egrave;tres issus de 
    trois groupes : les r&egrave;gles collectives, les populations de comportements 
    individuels et des param&egrave;tres de structure et d'environnement tel que 
    la taille du p&eacute;rim&egrave;tre ou les pertes par infiltration.</p>
   <p>Apr&egrave;s une phase de tests de sensibilit&eacute;, le mod&egrave;le ainsi obtenu est apparu 
    pertinent pour un usage en recherche, capable de discriminer des sc&eacute;narios 
    en fonction de leur viabilit&eacute; vue comme la dur&eacute;e de mise en œuvre du syst&egrave;me 
    irrigu&eacute; sans intervention ext&eacute;rieure.</p>
   <p>Cependant il n'est pas ais&eacute; au premier abord pour des acteurs ext&eacute;rieurs 
    au processus de cr&eacute;ation du mod&egrave;le d'entrer dans sa logique. Que ceux-ci 
    soient familiers avec l'outil informatique ou avec le terrain repr&eacute;sent&eacute;, 
    le mod&egrave;le conserve un aspect boîte noire qui rend n&eacute;cessaire son explicitation. 
    Pour ouvrir cette derni&egrave;re, nous nous sommes orient&eacute;s vers la r&eacute;alisation 
    d'un jeu de rôles. De nombreux &eacute;l&eacute;ments caract&eacute;ristiques de jeux et de 
    SMA peuvent en effet &ecirc;tre associ&eacute;s : agent/joueur, r&egrave;gle/rôle… Ce recours 
    au jeu revient en fait &agrave; faire vivre le d&eacute;roulement du mod&egrave;le aux personnes 
    &agrave; qui on veut le pr&eacute;senter.</p>
   <p>La traduction a impliqu&eacute; plusieurs simplifications pour pouvoir pratiquer 
    le jeu. Celle-ci s'est faite en plusieurs &eacute;tapes avec un groupe de joueurs 
    test connaissant bien le terrain. Le jeu se joue avec 10 &agrave; 15 joueurs 
    et est constitu&eacute; de cartes trilingues (fran&ccedil;ais, pulaar, wolof) d&eacute;crivant 
    les comportements possibles pour chaque joueur, de deux lieux s&eacute;par&eacute;s 
    repr&eacute;sentant l'un village et l'autre le p&eacute;rim&egrave;tre et d'un ensemble de 
    cartes " occasion " reproduisant les aspects al&eacute;atoires du mod&egrave;le.</p>
   <p>Ce jeu de rôles a tout d'abord &eacute;t&eacute; men&eacute; dans les villages m&ecirc;me où les 
    enqu&ecirc;tes ayant permis la constitution du mod&egrave;le ont &eacute;t&eacute; faites.</p>
   <p align="center"><img src="/images/applica/shadoc2.jpg" width="352" height="157"></p>
   <p align="center">Photo 1. Au cours du jeu de r&ocirc;les</p>
   <p>Dans un deuxi&egrave;me temps, un an plus tard, le jeu fut pr&eacute;sent&eacute; lors d'un 
    atelier organis&eacute; au S&eacute;n&eacute;gal pr&eacute;s de Saint Louis, dans un contexte un peu 
    diff&eacute;rent (voir photo 1). Cet atelier durait trois jours: le premier jour, 
    les joueurs d&eacute;couvraient le jeu de rôles, ce qui leur permettait de faire 
    une ou deux campagnes. Le deuxi&egrave;me jour &eacute;tait consacr&eacute;e &agrave; un long jeu 
    sur cinq ou six campagnes, permettant d'observer les effets &agrave; long terme 
    des d&eacute;cisions. Au cours du troisi&egrave;me jour des simulations sur ordinateur 
    ont &eacute;t&eacute; propos&eacute;es, en utilisant une nouvelle version du mod&egrave;le, simplifi&eacute;e, 
    correspondant exactement &agrave; la version propos&eacute;e dans le jeu.</p>
   <p>Dans les deux cas, il a &eacute;t&eacute; bien accept&eacute; et a suscit&eacute; de nombreuses discussions 
    sur les syst&egrave;mes r&eacute;els, validant ainsi un usage en outil d'animation. 
    Dans plusieurs cas, on nous a demand&eacute; de laisser le jeu sur place pour 
    des s&eacute;ances suppl&eacute;mentaires anim&eacute;es localement. Il a fini par &ecirc;tre baptis&eacute; 
    en pulaar : Njobaari Ilnoowo, ce qui signifie " le n&eacute;cessaire de voyage 
    de l'irrigant ".</p>
   <p>Pour en savoir plus, consultez la page &quot;<a href="http://www.montpellier.cemagref.fr/irrigation/them-getirri.htm">Gestion 
    int&eacute;gr&eacute;e des p&eacute;rim&egrave;tres et des bassins versants irrigu&eacute;s</a>&quot; du 
    Cemagref ou <a href="mailto:barreteau@montpellier.cemagref.fr">contactez 
    l'auteur</a>.</p>
   <!--#include virtual="/include/copyright_fr.inc" -->
	</td>
  <td width="15" valign="top" bgcolor="#FFFFFF"> 
   <div align="right" class="texte"></div>
  </td>
 </tr>
</table>
</body>
</html>
