<html>
<head>
<meta name="KeyWords" content="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">
<title>SimPolilla</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<!--#include virtual="/include/script.inc" -->
<link rel="stylesheet" href="/css/cormas.css" -->
</head>
<body marginwidth="0" marginheight="0" topmargin="0" leftmargin="0" border="0" onLoad="MM_preloadImages('/images/fr/accueil_r.gif','/images/fr/demarche_r.gif','/images/fr/logiciel_r.gif','/images/fr/applications_r.gif','/images/fr/biblio_r.gif','/images/fr/formation_r.gif','/images/fr/reseaux_r.gif')" bgcolor="#FFFFFF">
<!--#include virtual="haut.inc" -->
<table cellspacing="0" cellpadding="0" border="0" width="100%">
<tr>
  <!--#include virtual="sommair.inc" --> 
    <td width="*" valign="top" bgcolor="#FFFFFF"> 
      <p>&nbsp; 
      <h1>SimPolilla<br>
        Mod&eacute;lisation de la dynamique spatiale d'un ravageur invasif dans 
        les Andes</h1>
      <h1><font size="3">Fran&ccedil;ois Rebaudo, V&eacute;ronica Crespo-P&eacute;rez, 
        Olivier Dangles</font></h1>
      <p><img src="../../images/applica/SimPolilla.jpg" width="400" height="269" align="right">SimPolilla 
        est un automate cellulaire permettant de simuler diff&eacute;rents scenarios 
        d&#146;invasion de la teigne de la pomme de terre <i>Tecia solanivora</i> 
        dans la Sierra Andine d'Equateur. Sp&eacute;cifiquement notre &eacute;quipe 
        cherche &agrave; comprendre les effets des activit&eacute;s anthropiques 
        sur la propagation de ce ravageur (lieux de stockage des tubercules, dispersion 
        via le commerce de pomme de terre semence, entre autres). Au-del&agrave; 
        du mod&egrave;le de la teigne de la pomme de terre en Equateur, nous tentons 
        d&#146;inscrire notre d&eacute;marche dans le cadre plus large de la mod&eacute;lisation 
        des esp&egrave;ces invasives en incluant une dimension sociale (mod&eacute;lisation 
        des agro-&eacute;cosyst&egrave;mes).</p>
      <h2>Le Mod&egrave;le</h2>
      <p>L'environnement est d&eacute;fini par un ensemble de couches issues d'un 
        Syst&egrave;mes d'Information G&eacute;ographique (usage du sol pour la 
        pr&eacute;sence ou absence de cultures, temp&eacute;rature, altitude, 
        pr&eacute;cipitations, villes et villages, nombre d'habitants, lieux de 
        stockage).<br>
        La teigne &eacute;volue dans ce paysage en fonction des contraintes locales 
        li&eacute;es &agrave; l'environnement mais aussi en fonction des activit&eacute;s 
        humaines. A titre d'exemple la dispersion du ravageur intervient de mani&egrave;re 
        diffuse par le mouvement propre du ravageur mais aussi de mani&egrave;re 
        saltatoire par le mouvement des agriculteurs de village &agrave; village.</p>
      <p>Cet automate cellulaire a &eacute;t&eacute; valid&eacute; par 3 ans de 
        donn&eacute;es r&eacute;alis&eacute;es gr&acirc;ce &agrave; des pi&egrave;ges 
        &agrave; ph&eacute;romones. Il est utilis&eacute; comme support pour des 
        formations aupr&egrave;s des partenaires locaux et des agriculteurs, et 
        de support pour le d&eacute;veloppement d'un mod&egrave;le multi-agents 
        &eacute;tudiant les dynamiques locales au sein d'une communaut&eacute; 
        d'agriculteurs.</p>
      <p>Pour plus d'informations sur cette application, <a href="mailto:francois.rebaudo@legs.cnrs-gif.fr">contacter 
        l'auteur </a></p>
      <p>&nbsp;</p>
      <!--#include virtual="/include/copyright_fr.inc" --> </td>
  <td width="15" valign="top" bgcolor="#FFFFFF"> 
   <div align="right" class="texte"></div>
  </td>
 </tr>
</table>
</body>
</html>
