<html>
<head>
<title>Thieul</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<!--#include virtual="/include/script.inc" -->
<link rel="stylesheet" href="/css/cormas.css" -->
</head>
<body marginwidth="0" marginheight="0" topmargin="0" leftmargin="0" border="0" onLoad="MM_preloadImages('/images/fr/accueil_r.gif','/images/fr/demarche_r.gif','/images/fr/logiciel_r.gif','/images/fr/applications_r.gif','/images/fr/biblio_r.gif','/images/fr/formation_r.gif','/images/fr/reseaux_r.gif')" bgcolor="#FFFFFF">
<!--#include virtual="haut.inc" -->
<table cellspacing="0" cellpadding="0" border="0" width="100%">
<tr>
  <!--#include virtual="sommair.inc" --> 
    <td width="*" valign="top" bgcolor="#FFFFFF"> 
      <p>&nbsp; 
      <h1>Thieul</h1>
      <h2>Multi usage de l'espace et des ressources autour d'un forage au Sahel</h2>
      <p>Auteurs: Ibra Tour&eacute;, Alassane Bah, Christophe Le Page, Patrick 
        d'Aquino </p>
      <p align="justify">D'une superficie 1 031.46 km2, l'unit&eacute; pastorale de Thieul est 
        situ&eacute;e dans la r&eacute;serve sylvo pastorale du Ferlo &agrave; 
        une soixantaine de kilom&egrave;tres au sud-est de Dahra (<a href="#carte">Carte 
        1</a>). Ce terroir adjacent au ranch de Doli et &agrave; la limite du 
        bassin arachidier est au c&#156;ur de l'expansion de l'agriculture et 
        son corollaire &agrave; savoir la r&eacute;duction des terres de parcours 
        et les diff&eacute;rends entre populations s&eacute;dentaires et pasteurs. 
        La population est tr&egrave;s diversifi&eacute;e, elle est compos&eacute;e 
        de trois grands groupes ethniques : les Peul, les Seereer et les Wolof.</p>
      <p align="justify">De par sa localisation, ce terroir agro sylvo pastoral constitue une 
        zone tampon aux plans morpho-p&eacute;dologique, climatique et socio-&eacute;conomique 
        qui lui conf&egrave;re toute sa diversit&eacute;. Le climat local est 
        de type sah&eacute;lien avec quelques influences du domaine soudanien 
        comme en atteste l'immense couverture herbac&eacute;e en saison humide. 
        Les ressources hydriques sont constitu&eacute;es d'une part par les points 
        d'eau permanents (puits, forage et antennes de forage) et d'autre part 
        des mares et vall&eacute;es situ&eacute;es autour de Thieul avec un &eacute;coulement 
        temporaire pluvial. </p>
      <p align="justify">Ces caract&eacute;ristiques bioclimatiques sp&eacute;cifiques continuent 
        d'attirer de nouvelles populations d'agriculteurs dont le nombre de campement 
        a augment&eacute; de 70% entre 1980 et 2000 contre seulement 30% entre 
        1935 et 1980. Ce flux de migrants a provoqu&eacute; un accroissement et 
        une extension des zones de cultures de 13% entre 1980-1999 mat&eacute;rialis&eacute; 
        par une fragmentation des paysages sur le front agricole et une r&eacute;duction 
        des terres de parcours du sud au nord. Aujourd'hui plusieurs projets de 
        d&eacute;veloppement existent dans la zone, autour des aires de desserte 
        de forage, pour suivre l'&eacute;tat des ressources naturelles et proposer 
        des am&eacute;nagements de l'espace et des ressources. Le projet d'appui 
        &agrave; l'&eacute;levage (Papel) lanc&eacute; en 1993 pr&eacute;conisait 
        une approche participative et d&eacute;centralis&eacute;e &agrave; l'&eacute;chelle 
        des communaut&eacute;s rurales pour prendre en compte les pr&eacute;occupations 
        de l'ensemble des acteurs en vue d'une gestion concert&eacute;e des ressources 
        autour des forages pastoraux &agrave; haut d&eacute;bit. Pour ce faire, 
        les premiers outils de planification et de gestion n&eacute;goci&eacute;s 
        entre les diff&eacute;rents acteurs ont &eacute;t&eacute; &eacute;labor&eacute;s 
        et test&eacute;s autour d'unit&eacute; pastorale (UP). Ce concept d'unit&eacute; 
        pastorale est constitu&eacute; de l'espace et de l'ensemble des ressources 
        polaris&eacute;s par un forage pastoral.</p>
      <p align="center"><img src="../../images/applica/thieul_Carte.gif" width="587" height="440"><a name="carte"></a> 
      </p>
      <p class=MsoNormal align=center style='margin-left:35.4pt;text-align:center'><b><span
style='font-size:10.0pt;mso-bidi-font-size:12.0pt'>Carte&nbsp;: Carte du Sénégal 
        <o:p></o:p></span></b><span
style='font-family:"Arial Narrow";mso-fareast-font-family:"Times New Roman"'><o:p></o:p></span></p>
      <p>Mais, malgr&eacute; les efforts consentis et les plans r&eacute;alis&eacute;s, 
        les r&eacute;sultats demeurent mitig&eacute;s sur le terrain. Ce constat 
        de non appropriation d'acquis en termes d'outils et de techniques de gestion 
        des ressources naturelles, pose le probl&egrave;me de l'inad&eacute;quation 
        ou de l'inadaptation des solutions propos&eacute;es qui occultent dans 
        leur conception les perceptions, les connaissances et les pratiques ainsi 
        que les besoins des populations locales.</p>
      <p>Comment d&eacute;finir leurs besoins et int&eacute;grer leurs connaissances 
        spatiales dans les plans de gestion des ressources, sous quelle forme 
        et &agrave; quelle &eacute;chelle ? Dans quel cadre les concevoir et les 
        utiliser avec les acteurs-d&eacute;cideurs (pasteurs, agro-pasteurs, agriculteurs, 
        leaders d'opinions, agents d'&eacute;tat&#133;) ? Autrement dit comment 
        optimiser leur utilisation dans les processus de n&eacute;gociation ?</p>
      <p>Pour mieux appr&eacute;hender les interactions entre espaces - ressources 
        - acteurs, nous nous sommes fix&eacute;s deux objectifs suivants : (i) 
        mettre au point un SMA pour tester des hypoth&egrave;ses et des sc&eacute;narios 
        d'intervention ou d'&eacute;v&eacute;nements afin de mieux affiner les 
        contours d'une approche globale et pluridisciplinaire pour la gestion 
        d'espace et de ressources partag&eacute;s ; (ii) &eacute;laborer des cadres 
        et approches m&eacute;thodologiques de concertation et/ou de n&eacute;gociation 
        avec les acteurs pour am&eacute;liorer les processus de d&eacute;cision 
        sur les ressources.</p>
      <p>La finalit&eacute; est de cr&eacute;er des outils et cadres de concertation 
        afin de traduire le plus fid&egrave;lement possible les besoins des populations 
        dans les projets de d&eacute;veloppement pour une gestion efficiente des 
        ressources naturelles<span
style='font-family:"Arial Narrow";mso-fareast-font-family:"Times New Roman"'><o:p></o:p></span></p>
      <h2 class=boldmath style='margin:0cm;margin-bottom:.0001pt'><span
style='font-family:Arial;mso-fareast-font-family:"Times New Roman"'>Démarche: 
        </span><span
style='font-size:11.0pt;mso-bidi-font-size:12.0pt;font-family:Arial;mso-fareast-font-family:
"Times New Roman";font-weight:normal'>&quot;Approche Participative&quot;</span></h2>
      <p class=boldmath style='margin:0cm;margin-bottom:.0001pt'><span
style='font-family:Arial;mso-fareast-font-family:"Times New Roman"'><o:p></o:p></span></p>
      <p class=boldmath style='margin:0cm;margin-bottom:.0001pt' align="center"><span
style='font-family:Arial;mso-fareast-font-family:"Times New Roman"'><o:p>
      <img src="../../images/applica/thieul8.gif" width="398" height="261" usemap="#t" border="0"></o:p></span></p>
      <div align="center"><font size="1">(Cliquer sur les images pour les agrandir)</font><br style='mso-ignore:vglayout' clear=ALL>
      </div>
      <address><span style='mso-bookmark:_Toc46035072'><span style='mso-bookmark:
_Toc46034902'><span style='mso-bookmark:_Toc46034676'>Simulateur «Thieul»</span></span></span> 
        <o:p></o:p></address>
      <table width="100%" border="0">
        <tr> 
          <td> 
            <div align="center">
              <img src="../../images/applica/thieul10.jpg" width="174" height="198"></div>
          </td>
          <td> 
            <div align="center"></div>
          </td>
          <td> 
            <div align="center">
              <img src="../../images/applica/thieul12.jpg" width="275" height="103"></div>
          </td>
        </tr>
      </table>
      <h2 class=T2><o:p></o:p><o:p></o:p></h2>
      <p class=legen2>Figure 11&nbsp;: Interface de paramétrage de la pluviométrie</p>
      <p class=legen2><a href="thieul12.png">
      <img src="../../images/applica/thieul12.jpg" width="275" height="103"></a></p>
      <p class=legen2 align="center">&nbsp;</p>
      <p class=legen2 align="left">Pour en savoir plus, contacter les <a href="mailto:ibra.toure@cirad.fr">auteurs</a> 
        <span style='font-family:"Arial Narrow"'><o:p></o:p></span></p>
      <h2>References</h2>
      <p>Bah A., Tour&eacute; I., Le Page C., Bousquet F., Diouf A. 2001. Un outil 
        de simulation multi-agents pour comprendre le multi usage de l'espace 
        et des ressources autour d'un forage au Sahel. Le cas de Thieul au S&eacute;n&eacute;gal. 
        In Th. Libourel Ed., G&eacute;omatique et espace rural, SIGMA, Actes des 
        journ&eacute;es de Cassini, Montpellier 26-28 septembre 2001, pp 105-117.</p>
      <p>Tour&eacute; I., Bah A. D'Aquino P., Dia I. 2003. Cartes &agrave; dire 
        d'experts, cartes &agrave; dire d'acteurs : vers une approche partag&eacute;e 
        des mod&egrave;les de repr&eacute;sentations spatiales d'espaces agropastoraux 
        sah&eacute;liens. Organisation spatiale et gestion des ressources et des 
        territoires ruraux. Actes du colloque, 25-27 f&eacute;vrier 2003, Montpellier, 
        France.</p>
      <p>Bah A; Tour&eacute; I.,Le Page Ch. 2003 An Agent-Based Model tool for 
        multi-agent simulation for Understanding the Multiple Uses of space Land 
        and Resources Around a Drilling Sites in the Sahel. Modsim 2003 International 
        Congress on Modelling and Simulation,July 2003 in Townsville, Queensland, 
        Australia</p>
      <p>A. Bah . I.Tour&eacute;; Ch. Le Page, S. Bald&eacute;, D. Badiane : Contribution 
        de syst&egrave;mes multi-agents pour la compr&eacute;hension du multi 
        usage de l'espace et des ressources autour d'un forage au Sahel. Le cas 
        de Thieul au S&eacute;n&eacute;gal. (article accept&eacute; et &agrave; 
        para&icirc;tre dans le Journal des Sciences pour l'Ing&eacute;nieur de 
        l'Ecole Sup&eacute;rieure Polytechnique de l'Universit&eacute; de Cheikh 
        Anta Diop de Dakar).</p>
      <p>&nbsp; </p>
      <!--#include virtual="/include/copyright_fr.inc" --> </td>
  <td width="15" valign="top" bgcolor="#FFFFFF"> 
   <div align="right" class="texte"></div>
  </td>
 </tr>
</table>
<map name="t">
<area shape="rect" coords="11, 43, 155, 216" href="../../images/applica/thieul4.jpg" target="_parent" alt="thieul4.jpg (159 ko)" title="thieul4.jpg (159 ko)"> 
  
  <area shape="rect" coords="259, 40, 393, 206" href="../../images/applica/thieul3.jpg" target="_parent">
  <area shape="rect" coords="161, 44, 241, 106" href="../../images/applica/thieul5.jpg" target="_parent">
  <area shape="rect" coords="160, 109, 238, 170" href="../../images/applica/thieul6.jpg">
  <area shape="rect" coords="158, 170, 239, 232" href="../../images/applica/thieul7.jpg">
</map>
</body>
</html>