<html>
<head>
<meta name="KeyWords" content="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">
<title> Telechargement du logiciel Cormas</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<!--#include virtual="/include/script.inc" -->
<link rel="stylesheet" href="/css/cormas.css" -->
</head>
<body  marginwidth="0" marginheight="0" topmargin="0" leftmargin="0" border="0" onLoad="MM_preloadImages('/images/fr/accueil_r.gif','/images/fr/demarche_r.gif','/images/fr/logiciel_r.gif','/images/fr/applications_r.gif','/images/fr/biblio_r.gif','/images/fr/formation_r.gif','/images/fr/reseaux_r.gif')" bgcolor="#FFFFFF">
<!--#include virtual="haut.inc" -->
<table cellspacing="0" cellpadding="0" border="0" width="100%">
<tr>
    <!--#include virtual="sommair.inc" --> 
    <td width="*" valign="top" bgcolor="#FFFFFF"> 
    <p>&nbsp; 
    <p> 
    <h1>
      T&eacute;l&eacute;chargement de Cormas</h1>
      <h2>Mise &agrave; jour de Cormas</h2>
      <p>Si vous avez d&eacute;j&agrave; install&eacute; Cormas, faites une simple 
        <a href="upgradeCormas.htm">mise &agrave; jour</a>.</p>
      <h2>Installer Cormas</h2>
      <h3>Avertissement</h3>
      <p>La proc&eacute;dure d'installation de Cormas se d&eacute;roule en 2 temps 
        : il faut installer VisualWorks, le langage de programmation d&eacute;livr&eacute; 
        gratuitement par Cincom puis Cormas. Malheureusement, il nous est <em>l&eacute;galement</em> 
        pas possible de fournir une version tout-en-un comprenant VisualWorks 
        et Cormas.</p>
      <p>VisualWorks (version gratuite, non commerciale) est disponible sur le 
        <a href="http://www.cincom.com/scripts/smalltalk.dll//downloads/index.ssp?content=visualworks" target="_blank">site 
        de Cincom</a>. Attention, VisualWorks p&egrave;se &agrave; peu pr&egrave;s 
        <em>60 Mo</em> (Base + VM) et Cormas, pr&egrave;s de <em>8 Mo</em>.</p>
      <h3>Etape 1/3 : la charte</h3>
    <p>CORMAS est un logiciel gratuit et le t&eacute;l&eacute;chargement 
      est ouvert &agrave; tous. N&eacute;anmoins, nous invitons les utilisateurs &agrave; lire et 
      &agrave; respecter la charte suivante :</p>
    <ul>
      <li>CORMAS est prot&eacute;g&eacute; par le droit d'auteur.</li>
      <li>CORMAS a &eacute;t&eacute; d&eacute;velopp&eacute; dans le cadre de recherches scientifiques sur 
      l'environnement et le d&eacute;veloppement. Il est n&eacute; de la capitalisation 
      de plusieurs d&eacute;marches de construction de mod&egrave;les de simulation du fonctionnement 
      d'&eacute;cosyst&egrave;mes &agrave; usages multiples. Ce principe originel de mise en commun 
      et de partage des exp&eacute;riences caract&eacute;rise l'&eacute;tat d'esprit d'utilisation 
      de Cormas, outil d'&eacute;change et de dialogue &agrave; propos de probl&egrave;mes de gestion 
      des ressources renouvelables. Ce logiciel pourra &ecirc;tre utilis&eacute; dans un 
      cadre plus large mais en respectant le m&ecirc;me &eacute;tat d'esprit.</li>
      <li>Vous pouvez t&eacute;l&eacute;charger CORMAS apr&egrave;s avoir rempli un formulaire &agrave; 
      l'attention des auteurs (il s'agit pour nous de connaître les contextes 
      d'utilisation du logiciel, les informations communiqu&eacute;es ne seront ni 
      diffus&eacute;es, ni utilis&eacute;es &agrave; des fins commerciales).</li>
      <li>Vous &ecirc;tes libre de diffuser CORMAS &agrave; condition de transmettre les 
      recommandations de cette charte, en particulier sur le droit d'auteur 
      et la n&eacute;cessit&eacute; de vous faire connaître.</li>
      <li>Si vous d&eacute;sirez modifier CORMAS, vous &ecirc;tes libre de le faire mais 
      ne diffusez-pas la version modifi&eacute;e. Par contre, vous pouvez signaler 
      vos remarques et modifications &agrave; la communaut&eacute; d'utilisateurs (&agrave; l'aide 
      du <a href="/fr/reseaux/forum.htm">forum</a>).</li>
      <li>CORMAS ne fait l'objet d'aucune garantie. Tous les risques sont assum&eacute;s 
      par l'utilisateur. </li>
    </ul>
    <p align="center"><a href="outform.htm">J'accepte</a></p>
    <!--#include virtual="/include/copyright_fr.inc" -->
	</td>
    <td width="15" valign="top" bgcolor="#FFFFFF"> 
    <div align="right" class="texte"></div>
    </td>
  </tr>
</table>
</body>
</html>
