<html>
<head>
<meta name="KeyWords" content="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">
<title> Présentation du logiciel Cormas</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<!--#include virtual="/include/script.inc" -->
<link rel="stylesheet" href="/css/cormas.css" -->
</head>
<body  marginwidth="0" marginheight="0" topmargin="0" leftmargin="0" border="0" onLoad="MM_preloadImages('/images/fr/accueil_r.gif','/images/fr/demarche_r.gif','/images/fr/logiciel_r.gif','/images/fr/applications_r.gif','/images/fr/biblio_r.gif','/images/fr/formation_r.gif','/images/fr/reseaux_r.gif')" bgcolor="#FFFFFF">
<!--#include virtual="haut.inc" -->
<table cellspacing="0" cellpadding="0" border="0" width="100%">
<tr>
    <!--#include virtual="sommair.inc" --> 
    <td width="*" valign="top" bgcolor="#FFFFFF"> 
    <p>&nbsp;
    <p> 
    <h1>
     Présentation de Cormas</h1>
      <h2>&nbsp;</h2>
      <p>Il existe quelques environnements de programmation d&eacute;di&eacute;s 
        &agrave; la cr&eacute;ation de syst&egrave;mes multi-agents. Nous pouvons 
        les classer en deux cat&eacute;goties: certains d'entre-eux sont orient&eacute;s 
        vers une communication entre syst&egrave;mes distribu&eacute;s, d'autres 
        sont ax&eacute;s vers la construction de mod&egrave;les de simulation 
        (voir page des <a href="../reseaux/liens.htm">liens</a>).</p>
      <p>L'environnement de programmation CORMAS appartient &agrave; cette deuxi&egrave;me 
        cat&eacute;gorie, avec une sp&eacute;cificit&eacute; dans le domaine de 
        la gestion des ressources renouvelables. Il offre un cadre de d&eacute;veloppement 
        de mod&egrave;les de simulation des modes de coordination entre des individus 
        et des groupes qui exploitent ces ressources en commun. Ce cadre se structure 
        en trois modules.</p>
    <ul>
      <li>Un premier module permet de d&eacute;finir les entit&eacute;s du syst&egrave;me 
      &agrave; mod&eacute;liser, que l'on appelle des agents informatiques, 
      et leurs interactions. Ces interactions s'expriment par des proc&eacute;dures 
      de communication directe (envois de messages), et/ou par le fait plus 
      indirect de partager le m&ecirc;me support spatial. </li>
      <li>Le second module concerne le contrôle de la dynamique globale (ordonnancement 
      des diff&eacute;rents &eacute;v&eacute;nements d'un pas de temps du 
      mod&egrave;le).</li>
      <li>Un troisi&egrave;me module permet de d&eacute;finir une observation 
      de la simulation selon des points de vue. Cette fonctionnalit&eacute; 
      autorise l'int&eacute;gration, dans le processus de mod&eacute;lisation, 
      des modes de repr&eacute;sentation.</li>
    </ul>
      <p align="center" class="texte"><img src="/images/outil/cormas.gif" width="399" height="293" align="absmiddle"></p>
      <p align="center" class="texte">Interface de Cormas</p>
    <p>CORMAS facilite le travail de construction 
      du mod&egrave;le en proposant au sein des ces trois modules des &eacute;l&eacute;ments 
      pr&eacute;d&eacute;finis. Parmi ces &eacute;l&eacute;ments figurent les 
      entit&eacute;s-type, qui sont des classes SmallTalk g&eacute;n&eacute;riques 
      &agrave; partir desquelles, par sp&eacute;cialisation et affinage, l'utilisateur 
      d&eacute;finit des entit&eacute;s particuli&egrave;res pour les besoins 
      de son application.</p>
      <p>CORMAS est une plateforme de simulation bas&eacute;e sur l'environnement 
        de programmation VisualWorks, qui permet de d&eacute;velopper des applications 
        en Smalltalk. Le logiciel peut &ecirc;tre <a href="outchar.htm">t&eacute;l&eacute;charg&eacute;</a>. 
        Les <a href="outguid.htm">guides pratiques</a> sont disponibles en ligne. 
        Les principaux <a href="uml-kernel.htm">diagrammes de classe</a> de l'architecture 
        du noyau sont disponibles.</p>
    <!--#include virtual="/include/copyright_fr.inc" -->
	</td>
    <td width="15" valign="top" bgcolor="#FFFFFF"> 
    <div align="right" class="texte"></div>
    </td>
  </tr>
</table>
</body>
</html>
