<html>
<head>
<meta name="KeyWords" content="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">
<title> Sylvopast et Mejan, negociations autour de plans de gestion</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<!--#include virtual="/include/script.inc" -->
<link rel="stylesheet" href="/css/cormas.css" -->
</head>
<body marginwidth="0" marginheight="0" topmargin="0" leftmargin="0" border="0" onLoad="MM_preloadImages('/images/en/accueil_r.gif','/images/en/demarche_r.gif','/images/en/logiciel_r.gif','/images/en/applications_r.gif','/images/en/biblio_r.gif','/images/en/formation_r.gif','/images/en/reseaux_r.gif')" bgcolor="#FFFFFF">
<!--#include virtual="haut.inc" -->
<table cellspacing="0" cellpadding="0" border="0" width="100%">
<tr>
  <!--#include virtual="sommair.inc" --> 
  <td width="*" valign="top" bgcolor="#FFFFFF"> 
 <p>&nbsp;</p><p>&nbsp;</p><p>THIS PAGE WILL BE SOON AVAILABLE IN ENGLISH</p> 
   <p>&nbsp;
   
      <h1>Sylvopast et Mejan (mod&egrave;les)</h1>
      <h2>Dynamique de paysages m&eacute;diterrann&eacute;ens</h2>
      <p>Michel Etienne, Inra</p>
 
      <p>Les mod&egrave;les Sylvopast et Mejan simulent la dynamique de paysages 
        m&eacute;diterrann&eacute;ens. Ils ont deux vocations: il peuvent &ecirc;tre 
        utilis&eacute;s pour repr&eacute;senter l'&eacute;volution du paysage 
        ou pour faire n&eacute;gocier des acteurs r&eacute;els autour d'un jeu 
        de r&ocirc;le. L'utilisation en tant que jeu de r&ocirc;le est d&eacute;crite 
        dans une <a href="etiennejeux.htm">autre page</a>.</p>
      <p>Dans les deux mod&egrave;les, des acteurs agissent sur un espace et suivent 
        des strat&eacute;gies contrast&eacute;es. La dynamique de l'espace est 
        observ&eacute;e &agrave; travers deux crit&egrave;res que sont les feux 
        dans les for&ecirc;ts m&eacute;diterran&eacute;ennes (Sylvopast) ou le 
        d&eacute;veloppement du pin dans des &eacute;cosyst&egrave;mes &agrave; 
        forte biodiversit&eacute; (Mejan).</p>
      <p>Sylvopast est construit autour d'un paysage forestier virtuel et de r&egrave;gles 
        de gestion de deux types d'agents: un berger et un forestier. Pour Mejan, 
        il s'agit d'un paysage agricole r&eacute;el avec un troisi&egrave;me type 
        d'agent (un parc national). </p>
   <p>Les agents partagent le m&ecirc;me milieu, donc le m&ecirc;me risque de feu 
    ou le m&ecirc;me processus biologique de d&eacute;veloppement du pin. 
    Mais leurs objectifs sont diff&eacute;rents (production animale, protection du 
    paysage, production de bois, biodiversit&eacute;, conservation de la nature).</p>
   <p>Les ressources naturelles sont d&eacute;finies par des combinaisons al&eacute;atoires 
    de couches de v&eacute;g&eacute;tation (arbres, buissons, herbes, cultures). Leur dynamique 
    d&eacute;pend de r&egrave;gles biologiques et de la gestion, ainsi que des feux ou du 
    d&eacute;veloppement du pin. La dynamique des feux et du d&eacute;veloppement 
    du pin d&eacute;pend de facteurs naturels et (topographie,vents dominants, 
    &acirc;ge des peuplements, etc.) et de facteurs de gestion.</p>
   <h2>Sylvopast</h2>
      <p>Dans Sylvopast, les strat&eacute;gies de gestion pastorales sont bas&eacute;es 
        sur la disponibilit&eacute; en fourrage, elle-m&ecirc;me fonction du climat 
        et de la v&eacute;g&eacute;tation. Les strat&eacute;gies de pr&eacute;vention 
        des feux sont bas&eacute;es sur les directions des vents dominants, sur 
        la valeur des for&ecirc;ts et les ressources financi&egrave;res disponibles.</p>
      <p>Le but principal est de d&eacute;terminer quelle r&eacute;partition de la 
        v&eacute;g&eacute;tation est la plus efficace au regard des objectifs 
        du plan de gestion et des strat&eacute;gies de n&eacute;gociation des 
        deux agents.</p>
   <h2>Mejan</h2>
      <p>Dans Mejan, Les strat&eacute;gies agropastorales d&eacute;pendent du 
        rapport entre cultures et pâturages, la pression de pâture, la position 
        de la bergerie et le niveau de conscience &eacute;cologique de l'agriculteur. 
        Les strat&eacute;gies de gestion foresti&egrave;res d&eacute;pendent du 
        statut de propri&eacute;t&eacute; et des lois foresti&egrave;res. Le parc 
        national essaye de faire disparaître le pin, pour conserver la biodiversit&eacute; 
        et les espaces ouverts.</p>
   <p> Les deux objectifs principaux sont de comparer des sc&eacute;narios de gestion 
    et de permettre aux agents d'&eacute;changer leur perception sur les processus 
    de d&eacute;veloppement du pin. Ceci peut conduire au d&eacute;veloppement de strat&eacute;gies 
    communes.</p>
      <p>Pour en savoir plus, <a href="mailto:etienne@avignon.inra.fr">contactez 
        l'auteur</a>.</p>
   <!--#include virtual="/include/copyright_en.inc" -->
	</td>
  <td width="15" valign="top" bgcolor="#FFFFFF"> 
   <div align="right" class="texte"></div>
  </td>
 </tr>
</table>
</body>
</html>
