<html>

<head>

<meta name="KeyWords" content="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">

<title>ORIZI</title>

<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">



<!--#include virtual="/include/script.inc" -->

<link rel="stylesheet" href="/css/cormas.css" -->

</head>

<body marginwidth="0" marginheight="0" topmargin="0" leftmargin="0" border="0" onLoad="MM_preloadImages('/images/en/accueil_r.gif','/images/en/demarche_r.gif','/images/en/logiciel_r.gif','/images/en/applications_r.gif','/images/en/biblio_r.gif','/images/en/formation_r.gif','/images/en/reseaux_r.gif')" bgcolor="#FFFFFF">

<!--#include virtual="haut.inc" -->

<table cellspacing="0" cellpadding="0" border="0" width="100%">

  <tr> 

    <!--#include virtual="sommair.inc" -->

    <td width="*" valign="top" bgcolor="#FFFFFF"> 

      <p>&nbsp;</p>

      <p>THIS PAGE WILL BE SOON AVAILABLE IN ENGLISH</p>

      <h1>Orizi </h1>

      <h1>Small irrigation systems under free management</h1>

      <p>Nicolas Becu (ENGREF), Pascal Perez (CIRAD)</p>

      <h2>Importance du facteur social dans la gestion collective de l'eau : Cas 

        du p&eacute;rim&egrave;tre irrigu&eacute; rizicole de Keji, Java Centre, 

        Indon&eacute;sie</h2>

      <p>Nicolas Becu (ENREF), Pascal Perez (CIRAD)</p>

      <p><img src="../../images/applica/orizi-0.gif" width="243" height="161" align="left">La 

        gestion de l'eau en Indon&eacute;sie devient de plus en plus probl&eacute;matique. 

        En effet au niveau des p&eacute;rim&egrave;tres amont des bassins versant, 

        les institutions gouvernementales se retirent et les agriculteurs se retrouvent 

        en quelque sorte livr&eacute;s &agrave; eux m&ecirc;me. Or au niveau des 

        zones amont de ces bassins versants, certains agriculteurs se plaignent 

        de ne pas avoir assez d'eau durant la saison s&egrave;che. Il nous a apparut 

        important de tester l'importance du facteur social au niveau de zone &agrave; 

        conflit car c'est dans ce genre de cas o&ugrave; il s'exprime le mieux. 

        Le mod&egrave;le Orizi se place tout &agrave; l'amont du BV l&agrave; 

        o&ugrave; le manque d'eau d&eacute;bute.</p>

      <p>&nbsp;</p>

      <p>L'objectif du mod&egrave;le est d'observer l'influence de diff&eacute;rent 

        type de comportement de gestion sur le d&eacute;bit en aval du p&eacute;rim&egrave;tre 

        et sur la viabilit&eacute; du p&eacute;rim&egrave;tre lui m&ecirc;me.</p>

      <h4>Structure d'Orizi</h4>

      <p>La dynamique bio-physique du mod&egrave;le consiste &agrave; chaque pas 

        de temps &agrave; distribuer l'eau provenant de la rivi&egrave;re et des 

        sources tout d'abord dans les canaux puis dans les parcelles. Les agents 

        agissent sur l'ouverture ou la fermeture des parcelles et ce sont ces 

        deux actions qui seront le lieu privil&eacute;gi&eacute; des interactions 

        du syst&egrave;me ; L'autre aspect de la dynamique biophysique est la 

        croissance du riz et son evapotranspiration mais ces aspects ont &eacute;t&eacute; 

        simplifi&eacute;s au maximum car ils ne sont pas d'un int&eacute;r&ecirc;t 

        primordial pour la question de d&eacute;part.</p>

      <p><img src="../../images/applica/orizi-3.gif" width="259" height="307" align="right">Dans 

        le mod&egrave;le, un agent riziculteur est d&eacute;finit par quatre attributs 

        principaux :</p>

      <ul>

        <li>sa strat&eacute;gie d'irrigation,</li>

        <li>le temps disponible pour la riziculture,</li>

        <li>sa motivation pour la riziculture d&eacute;pendante de l'importance 

          qu'&agrave; la culture de riz dans son syst&egrave;me d'exploitation</li>

        <li>son caract&egrave;re (individualiste, coop&eacute;ratif ou soumis).</li>

      </ul>

      <p>Chacun de ces attributs va guider ces choix et son comportement vis a 

        vis de la gestion individuelle de sa parcelle et de ces interactions avec 

        les autres riziculteurs.</p>

      <p>En jouant sur les caract&eacute;ristiques de comportement de la population, 

        le simulateur permet de tester diff&eacute;rents sc&eacute;narios et de 

        mettre en avant leur importance dans un processus collectif.</p>

      <p>&nbsp;</p>

      <h2 align="left">References </h2>

      <ul>
        <li>For more information, contact the authors <font face="Georgia, Times New Roman, Times, serif">(<a href="mailto:pascal.perez@cirad.fr">Pascal 
          Perez</a> et <a href="mailto:nicolas_becu@yahoo.com">Nicolas Becu</a>)</font>.</li>
        <li>Download the model (<a href="/logiciel/Orizi.zip">zip file</a>, 95 Ko) </li>
      </ul>
      <p>&nbsp;</p>

      <h1>&nbsp;</h1>

      <!--#include virtual="/include/copyright_en.inc" -->

    </td>

    <td width="15" valign="top" bgcolor="#FFFFFF"> 

      <div align="right" class="texte"></div>

    </td>

  </tr>

</table>

</body>

</html>

