<html>



<head>



<meta name="KeyWords" content="Cormas, Cirad, gestion des ressources naturelles, natural resource management, INRM, environnement, environment, simulation, modelisation, modelling, SMA, MAS, multi-agent, smalltalk, visualworks, logiciel, software">



<title>Th&egrave;ses de doctorat et HDR</title>



<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">







<!--#include virtual="/include/script.inc" -->



<link rel="stylesheet" href="/css/cormas.css" -->



</head>



<body  marginwidth="0" marginheight="0" topmargin="0" leftmargin="0" border="0" onLoad="MM_preloadImages('/images/en/accueil_r.gif','/images/en/demarche_r.gif','/images/en/logiciel_r.gif','/images/en/applications_r.gif','/images/en/biblio_r.gif','/images/en/formation_r.gif','/images/en/reseaux_r.gif')" bgcolor="#FFFFFF">



<!--#include virtual="haut.inc" -->



<table cellspacing="0" cellpadding="0" border="0" width="100%">



<tr>



    <!--#include virtual="sommair.inc" --> 



    <td width="*" valign="top" bgcolor="#FFFFFF"> 



 <p>&nbsp;</p>



      <h1> Th&egrave;ses (doctorats, HDR)</h1>


      <p><em><strong><font color="#666666" size="4">2012</font></strong></em></p>
      <p>Henry A. 2012. Am&eacute;nagement des Eco-quartiers et de la Biodiversit&eacute;. 
        Th&egrave;se de doctorat en Sciences du Vivant d'AgroParisTech. 168 pages 
        + annexes <a href="/pdf/Henry_2012_PhD.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a> 
        <a href="/pdf/Henry_2012_PhD_Presentation.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a> 
      </p>
      <p>Rebaudo F. 2012. Mod&eacute;lisation de la dynamique spatio-temporelle 
        d&#146;insectes ravageurs des cultures dans des syst&egrave;mes socio-&eacute;cologiques. 
        Th&egrave;se de doctorat en sciences de la vie de l'Universit&eacute; 
        Pierre et Marie Curie.</p>
      <p><em><strong><font color="#666666" size="4">2011</font></strong></em></p>
      <p>Campo P. 2011. Un cadre pour la mise en oeuvre de la Mod&eacute;lisation 
        d'Accompagnement et de l'Analyse Institutionnelle: Une &eacute;tude de 
        cas &agrave; Palawan, Philippines. Th&egrave;se de doctorat en g&eacute;ographie 
        humaine, &eacute;conomique et r&eacute;gionale de l'Universit&eacute; 
        Paris Ouest Nanterre-La D&eacute;fense. 281 pages + annexes <a href="http://www.commod.org/pdf/Campo_2011_PhD.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Delmotte S. 2011. Evaluation participative de sc&eacute;narios : quelles 
        perspectives pour les syst&egrave;mes agricoles camarguais ? Th&egrave;se 
        de doctorat en agronomie de Montpellier SupAgro <a href="/pdf/Delmotte_2011_PhD.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a> 
        <a href="/pdf/Delmotte_2011_PhD_S.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Dupont H. 2011. Mod&eacute;lisation multi-agents d'un service &eacute;cosyst&eacute;mique, 
        sc&eacute;narios de syst&egrave;mes d'&eacute;quarrissage par des rapaces 
        n&eacute;crophages. Th&egrave;se de doctorat en Fronti&egrave;res Interdisciplinaires 
        du Vivant de l'Ecole Normale Sup&eacute;rieure. 308 pages. <a href="http://tel.archives-ouvertes.fr/docs/00/59/85/63/PDF/Dupont_MS2011.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Raj Gurung T. 2011. Analyse compar&eacute;e de l'usage de la mod&eacute;lisation 
        d'accompagnement pour faciliter la gestion adaptative de l'eau agricole 
        au Bhoutan. Th&egrave;se de doctorat en g&eacute;ographie humaine, &eacute;conomique 
        et r&eacute;gionale de l'Universit&eacute; Paris Ouest Nanterre-La D&eacute;fense. 
        377 pages + annexes <a href="http://www.commod.org/pdf/Gurung_2011_PhD.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p><em><strong><font color="#666666" size="4">2010</font></strong></em></p>
      <p>Dumrongrojwatthana P. 2010. Interactions entre &eacute;levage bovin et 
        reboisement dans le socio-&eacute;cosyst&egrave;me des hautes terres de 
        la province de Nan au Nord de la Tha&iuml;lande : un processus de mod&eacute;lisation 
        d'accompagnement pour am&eacute;liorer la gestion du paysage. Cotutelle: 
        th&egrave;se de doctorat en g&eacute;ographie humaine, &eacute;conomique 
        et r&eacute;gionale de l'Universit&eacute; Paris Ouest Nanterre-La D&eacute;fense 
        et PhD in Agricultural Technology, faculty of Science, Chulalongkorn University, 
        Thailand. 325 pages + annexes <a href="../../pdf/Pongchai_2010_PhD.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Promburom P. 2010. Companion modeling &amp; watershed management in Northern 
        Thailand: the importance of local networks. Th&egrave;se de l'&eacute;cole 
        doctorale &quot;Evolution, Ecosyst&egrave;mes, Microbiologie, Mod&eacute;lisation&quot; 
        de l'Universit&eacute; Claude Bernard Lyon 1, France. 187 pages + annexes 
        <a href="http://cormas.cirad.fr/pdf/Promburom_2010_PhD.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a> 
      </p>
      <p>Worrapimphong K. 2010. Integrated and collaborative ecological and socio-economic 
        modelling for sustainable razor clam management at Don Hoi Lord Ramsar 
        site, Thailand. PhD in Agricultural Technology, faculty of Science, Chulalongkorn 
        University, Thailand. 201 pages + annexes <a href="http://www.commod.org/pdf/Kobchai_2010_PhD.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p><em><strong><font color="#666666" size="4">2009</font></strong></em></p>
      <p>Bommel P. 2009. Définition d'un cadre méthodologique pour la conception 
        de modèles multi-agents adaptée a la gestion des ressources renouvelables. 
        Thèse de l'université de Montpellier II, sciences et techniques du Languedoc. 
        288 pages + annexes <a href="../../pdf/these-Bommel.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Guechtouli W. 2009. Dynamique du processus de transfert de connaissances 
        au sein d’une communaut&eacute; de pratique : Une mod&eacute;lisation 
        multi-agents. Th&egrave;se de doctorat, universit&eacute; Paul C&eacute;zanne, 
        Aix-Marseille III, sciences &eacute;conomiques. 255 pages + annexes <a href="/pdf/theseWG.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Le Canh Dung. 2009. Environmental and socio-economic impacts of rice-shrimp farming: companion modelling case study in Bac Lieu Province, Mekong Delta, Vietnam. PhD in Agricultural Technology, faculty of Science, Chulalongkorn University, Thailand. 140 pages + annexes. <a href="/pdf/Dung_PhD_2009.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Naivinit W. 2009. Companion Modelling to analyze the land/water use and 
        labour migration interactions in Lam Dome Yai Watershed, Lower Northeast 
        Thailand. Cotutelle th&egrave;se de doctorat en g&eacute;ographie humaine, 
        &eacute;conomique et r&eacute;gionale de l'Universit&eacute; Paris Ouest 
        Nanterre-La D&eacute;fense et PhD in Agricultural Technology, faculty 
        of Science, Chulalongkorn University, Thailand.<a href="/pdf/Naivinit_2009_PhD.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>van Oel P. 2009. Spatiotemporal interdependencies between water use and water availability in a semi-arid river basin. PhD Twente University, the Netherlands. 121 pages <a href="/pdf/VanOel_PhD_2009.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p><em><strong><font color="#666666" size="4">2008</font></strong></em></p>
      <p> Celso dos Reis P.G. 2008. Amazônia dos rios: Modelagem participativa 
        da gestão do uso do solo para o empoderamento local. Tese de Doutorado 
        da Universidade de Brasília, Centro de Desenvolvimento Sustentável . 306 
        pages <a href="/pdf/TesePCelso.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Barnaud C. 2008. &Eacute;quit&eacute;, jeux de pouvoir et l&eacute;gitimit&eacute; 
        : les dilemmes d'une gestion concert&eacute;e des ressources renouvelables. 
        Mise &agrave; l'&eacute;preuve d'une posture d'accompagnement critique 
        dans deux syst&egrave;mes agraires des hautes terres du Nord de la Tha&iuml;lande. 
        Th&egrave;se de doctorat, universit&eacute; Paris X Nanterre, g&eacute;ographie 
        humaine, &eacute;conomique et r&eacute;gionale. 365 pages + annexes <a href="/pdf/Barnaud_2008_PhD.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Bah A. 2008. Conception participative de simulations   multi-agents. Embauche d'un cadre m&eacute;thodologique. Th&egrave;se de doctorat de l'Ecole Pratique des Hautes Etudes Paris, Sp&eacute;cialit&eacute; INFORMATIQUE, Mention ED Syst&egrave;mes int&eacute;gr&eacute;s, Environnement et Biodiversit&eacute;, 277p. <a href="mailto:bah@ucad.sn "><img src="/images/mail.gif" width="16" height="17" align="absbottom" border="0"></a></p>
      <p>Saqalli M. 2008. Populations, Farming systems and Social 
        transitions in Sahelian Niger: 
      An Agent-based Modeling Approach. Th&egrave;se de doctorat, Universit&eacute; Catholique de Louvain -
      Facult&eacute; d&rsquo;Ing&eacute;nierie Biologique, Agronomique et Environnementale - 
      D&eacute;partement des Sciences du Milieu et de l&rsquo;Am&eacute;nagement du Territoire. 256 pages + annexe <a href="http://www.padniger.net/Documents%20and%20Reports/Biblio/Saqalli_Thesis2008.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p><em><strong><font color="#666666" size="4">2007</font></strong></em></p>
      <p>Morales GrossKopf H. 2007. L'évaluation des conséquences de décisions 
        stratégiques en élevage extensif en Uruguay Une approche par les systèmes 
        multi-agents. Th&egrave;se de doctorat de l'Institut des Sciences et Industries 
        du Vivant et de l&rsquo;Environnement - AgroParisTech, Paris, &eacute;cole 
        doctorale &quot; Agriculture, Alimentation, Biologie, Environnements et 
        Sant&eacute;&quot; (ABIES), 243 pages + annexe <a href="/pdf/HermesMG_2007_PhD.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Riedel J. L. F. 2007. Bases para la gesti&oacute;n sostenible del Parque de la Sierra y Ca&ntilde;ones de Guara:
        interacciones entre la ganader&iacute;a
        y la din&aacute;mica de la vegetaci&oacute;n. Th&egrave;se de doctorat, Universit&eacute; de Saragosse (Espagne), facult&eacute; v&eacute;t&eacute;rinaire, d&eacute;partement d'agriculture et d'&eacute;conomie rurale. 188 pages + annexes <a href="/pdf/Riedel_TesisDoctoral.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p><em><strong><font color="#666666" size="4">2006</font></strong></em></p>
      <p>Arrignon F. 2006. HOVER-WINTER : un mod&egrave;le multi-agent pour simuler la dynamique hivernale d&rsquo;un insecte auxiliaire des cultures (Episyrphus balteatus, Diptera: Syrphidae) dans un paysage h&eacute;t&eacute;rog&egrave;ne. Th&egrave;se de doctorat, Institut National Polytechnique de Toulouse, Sciences &Eacute;cologiques V&eacute;t&eacute;rinaires Agronomiques et Bioing&eacute;nieries (sp&eacute;cialit&eacute; : &eacute;cologie). 222 p. <a href="/pdf/Arrignon_2006_PhD.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>B&eacute;cu N. 2006. Identification et mod&eacute;lisation des repr&eacute;sentations des acteurs locaux pour la gestion des bassins versants. Th&egrave;se de doctorat, Universit&eacute; de Montpellier 2, 344 p. <a href="/pdf/TheseBecu.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Caplat, P. 2006 Importance de l'agriculture dans la dynamique spatio-temporelle du paysage. L'exemple du Causse M&eacute;jean. Th&egrave;se de Doctorat en Biologie des Populations et Ecologie. Ecole Nationale Sup&eacute;rieure Agronomique de Montpellier, Montpellier, 328p.&nbsp;<a href="http://www.cefe.cnrs.fr/dse/pers/anciens/Paul_Caplat.htm" target="_blank"> <img src="/images/renvoi.gif" width="15" height="15" border="0"></a> </p>
      <p>Etienne M. 2006. Dossier de candidature pour le concours de Directeur 
        de Recherche de 2&deg; classe. 43 pages. <a href="/pdf/Etienne_dossierDR2_2006.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Guyot P. 2006. Simulations multi-agents participatives. Faire interagir 
        humains et agents pour mod&eacute;liser, explorer et reproduire les comportements 
        collectifs. PhD Thesis, Paris, Paris 6 University, 195 p.<a href="/pdf/Guyot_2006_PhD.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Urbani D. 2006. Elaboration d'une approche hybride SMA-SIG pour la d&eacute;finition 
        d'un syst&egrave;me d'aide &agrave; la d&eacute;cision; application &agrave; 
        la gestion de l'eau. Th&egrave;se de doctorat en Informatique de l'Universit&eacute; 
        de Corse, 138 pages. <a href="http://hal-univ-corse.archives-ouvertes.fr/docs/00/13/61/06/PDF/TheseURBANI.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Vivianette C. 2006. Exploitation socio-&eacute;conomique de la mod&eacute;lisation 
        souterraine du transfert des nitrates &agrave; l'&eacute;chelle du bassin 
        de la Seine. Th&egrave;se de doctorat en hydrologie et hydrog&eacute;ologie 
        quantitatives de l'Ecole Nationale Sup&eacute;rieure des Mines de Paris, 
        309 p. <a href="http://pastel.paristech.org/bib/archive/00001750/" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p><em><strong><font color="#666666" size="4">2005</font></strong></em></p>
      <p>Bonaudo T. 2005. La gestion environnementale sur un front pionnier amazonien, Paris, Th&egrave;se de doctorat de l'Institut National d'Agronomie de Paris-Grignon et Centre de d&eacute;veloppement durable de l'Universit&eacute; de Brasilia, 370 p.<a href="/pdf/theseBonaudo.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p>Houdart M. 2005. Organisation spatiale des activités agricoles et pollution 
        des eaux par les pesticides. Modélisation appliquée au bassin-versant 
        de la Capot, Martinique. Th&egrave;se de doctorat en G&eacute;ographie 
      de l’Université des Antilles et de la Guyane, Fort de France, Martinique. <a href="/pdf/theseHoudart.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a> </p>
      <p>Roda J.-M. (2005). R&eacute;seaux d'entreprises et strat&eacute;gies industrielles dans les for&ecirc;ts tropicales. Th&egrave;se de doctorat/ PhD, Paris, Universit&eacute; de Paris 7, 393 p. <a href="http://ctbg.cirad.fr/ctbg/ecompl/publi/These_Roda.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p><em><strong><font color="#666666" size="4">2004</font></strong></em></p>
      <p>Abrami, G. 2004. Niveaux d'organisation dans la mod&eacute;lisation multi-agents 
        pour la gestion de ressources renouvelables. Application &agrave; la mise 
        en Suvre de r&egrave;gles collectives de gestion de l'eau agricole 
        dans la basse-vall&eacute;e de la Dr&ocirc;me. Th&egrave;se en Sciences 
        de l'eau, Engref, Montpellier <a href="/pdf/theseAbrami.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>
      <p><b><i><font color="#666666" size="4">2003</font></i></b></p>

      <p>Bakam, I. 2003. Des syst&egrave;mes multi-agents aux r&eacute;seaux de 

        p&eacute;tri pour la gestion des ressources naturelles : Le cas de la 

        faune dans l'est cameroun. PhD thesis. University of Yaound&eacute; 1, 

        Yaound&eacute;, Cameroun <a href="/pdf/thesebakam.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a> 

      </p>

      <p>Farolfi S. 2003. Système agroalimentaire et environnement : d’une approche 
        économique néoclassique à la recherche-action pour l’aide à la décision 
        et à la négociation. Habilitation &agrave; Diriger des Recherches, Universit&eacute; 
        de Montpellier I, Facult&eacute; de Sciences Economiques. 62 pp. [<a href="/pdf/hdrFarolfi.pdf">full 
        text </a>] [<a href="/pdf/hdrFarolfiResume.pdf">abstract</a>] </p>
      <p>Purnomo, H., 2003. A Modeling Approach to Collaborative Forest Management. 
        PhD thesis. Bogor Agricultural University, Indonesia <a href="/pdf/purnomoPhD.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>

      <p><b><i><font color="#666666" size="4">2002</font></i></b></p>

      <p>Galtier, F. 2002. Information, institutions et efficacit&eacute; des 

        march&eacute;s: Analyse de trois fili&egrave;res c&eacute;r&eacute;ali&egrave;res 

        d'Afrique de l'Ouest comme des &quot;syst&egrave;mes de communication&quot;. 

        Th&egrave;se de doctorat en sciences &eacute;conomiques. Ecole Nationale 

        Sup&eacute;rieure Agronomique de Montpellier.<a href="/pdf/these_FGaltier.pdf"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>

      <p>D'Aquino, P. 2002. Accompagner une ma&icirc;trise ascendante des territoires 

        : Pr&eacute;mices d'une g&eacute;ographie de l'action territoriale. M&eacute;moire 

        d'Habilitation &agrave; Diriger les Recherches. Universit&eacute; de Provence, 

        Aix en Provence. <a href="/pdf/hdrdaquino.pdf"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>

      <p>M&uuml;ller, J.P., 2002. Des syst&egrave;mes autonomes aux syst&egrave;mes 

        multi-agents : Interaction, &eacute;mergence et syst&egrave;mes complexes. 

        M&eacute;moire pour l'Habilitation &agrave; Diriger les Recherches, Universit&eacute; 

        Montpellier II <a href="/pdf/HDR_JP-Muller.pdf"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a> 

      </p>

      <p><b><i><font color="#666666" size="4">2001</font></i></b></p>

      <p>Bousquet, F., 2001. Mod&eacute;lisation d'accompagnement, Simulations 

        multi-agents et gestion des ressources naturelles et renouvelables. M&eacute;moire 

        pour l'Habilitation &agrave; Diriger les Recherches, Universit&eacute; 

        Lyon 1 <a href="/pdf/hdrbousquet.pdf"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>

      <p>Feuillette, S., 2001. Towards a demand management on a free-accessible 

        watertable: exploring interactions between water resource and uses by 

        multi-agent systems. Application to the Kairouan watertable, Center of 

        Tunisia. Montpellier, Ecole Nationale du Génie Rural, des Eaux et des 

        Forêts. <a href="/pdf/thesesf.pdf"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>

      <p><b><i><font color="#666666" size="4">2000</font></i></b></p>

      <p>Mathevet, R., 2000. Usages des zones humides camarguaises: enjeux et 

        dynamique des interactions Environnement/Usagers/Territoire. Lyon, Université 

        Jean Moulin Lyon 3. 481p.</p>

      <p>Rouchier, J., 2000. La confiance à travers l'échange. Accès aux pâturages 
        au Nord-Cameroun et échanges non-marchands: des simulations dans des systèmes 
        multi-agents. Orléans, Université d'Orléans. 372p.<a href="/pdf/theseRouchier.pdf" target="_blank"> 
        <img src="/images/renvoi.gif" width="15" height="15" border="0"></a> Collection 
        &quot;Regard sur les th&egrave;ses&quot; du Cirad (r&eacute;sum&eacute;, 
        pr&eacute;sentation et plan), 38 p. <a href="/pdf/thesejr2.pdf" target="_blank"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>

      <p><b><i><font color="#666666" size="4">1998</font></i></b></p>

      <p>Barreteau, O., 1998. Un système Multi-Agent pour explorer l viabilité 

        des systèmes irrigués: dynamique des interactions et modes d'organisation. 

        Montpellier, Ecole Nationale du Génie Rural, des Eaux et des Forêts. 260p. 

        <a href="/pdf/theseob.pdf"><img src="/images/renvoi.gif" width="15" height="15" border="0"></a></p>

      <p>&nbsp;</p>



      <p>&nbsp;</p>



      <p>&nbsp;</p>



      <p>&nbsp;</p>



      <p>&nbsp;</p>



      <p>&nbsp;</p>



      <!--#include virtual="/include/copyright_en.inc" -->



	</td>



    <td width="15" valign="top" bgcolor="#FFFFFF"> 



    <div align="right" class="texte"></div>



    </td>



  </tr>



</table>



</body>



</html>



